{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Question-about-Gestational-Diabetes-/show/2156093"
    },
    {
      "USER_NAME": "CedesMarie"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7273216"
    },
    {
      "POST_TITLE": "Question about Gestational Diabetes"
    },
    {
      "POST_BODY": "I am 27 weeks and I recently took my gestational diabetes test. I failed with a level of 150! I have to go back to take the 3 hour test to see if I have gestational diabetes! I don't understand why I would because my weight has always been normal, my blood pressure has been good, I've passed all the test so far, and my baby moves all the time... I'm scared I will have preterm labor if I have it.. Has this happened to anyone who was diagnosed with gestational diabetes ???!!"
    },
    {
      "POST_DATE": "2014-04-22T19:10:38-05:00"
    },
    {
      "POST_ID": "2156093"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "firsttime_mommy_to_be"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/6747575"
            },
            {
              "RESPONSE_BODY": "When I took mine I failed the first one too and had to go back for the 3 hour. I cut out all sugars for a week before my 3 hour test. The first drawing after the drink came back high but the second and third were normal. It could've been something you ate that was still in your system. Try watching the sugar intake and make sure your exercising and getting plenty of water. Best of luck to you!"
            },
            {
              "RESPONSE_DATE": "2014-04-22T19:20:15-05:00"
            },
            {
              "RESPONSE_ID": "10277719"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "elocinin"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8216878"
            },
            {
              "RESPONSE_BODY": "Gestational diabetes has nothing to do with any of what you listed. Sometimes women just get it while pregnant. I wouldn't worry too much bc in most cases it will go away after the baby. Preterm labor can happen for a million diff reasons so don't stress too much. I just took my test im waiting for the results so im worried bc diabetes runs in my family and ive always been terrified of having it. Like I said don't worry it should be fine if the second test does come up positive most likely you will only have to deal with it until you have the baby. Goodluck"
            },
            {
              "RESPONSE_DATE": "2014-04-22T20:02:48-05:00"
            },
            {
              "RESPONSE_ID": "10277940"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}