{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/-what-are-the-Gestational-diabetes/show/3018397"
    },
    {
      "USER_NAME": "mehakpreetkaur"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20818875"
    },
    {
      "POST_TITLE": "what are the Gestational diabetes"
    },
    {
      "POST_BODY": "This type affects females during pregnancy. Some women have very high levels of glucose in their blood, and their bodies are unable to produce enough insulin to transport all of the glucose into their cells, resulting in progressively rising levels of glucose.\r\rDiagnosis of gestational diabetes is made during pregnancy.\r\rThe majority of gestational diabetes patients can control their diabetes with exercise and diet. Between 10% to 20% of them will need to take some kind of blood-glucose-controlling medications. Undiagnosed or uncontrolled gestational diabetes can raise the risk of complications during childbirth. The baby may be bigger than he/she should be.\r\rScientists from the National Institutes of Health and Harvard University found that women whose diets before becoming pregnant were high in animal fat and cholesterol had a higher risk for gestational diabetes, compared to their counterparts whose diets were low in cholesterol and animal fats.\rhttps://www.medicalnewstoday.com/"
    },
    {
      "POST_DATE": "2018-03-26T01:19:19-05:00"
    },
    {
      "POST_ID": "3018397"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "ethanscott"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20824135"
            },
            {
              "RESPONSE_BODY": "I have a question. My wife is about to have her second child in a few months and I think she is suffering  from Gestational diabetes since her family never had a history of diabetes.\rMy question is if Gestational Diabetes is temporary of permanent?\rDoes it stop after pregnancy or how does it work?\rIt would be great if someone explains it to me."
            },
            {
              "RESPONSE_DATE": "2018-04-23T01:10:21-05:00"
            },
            {
              "RESPONSE_ID": "14330018"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "Hi Ethanscott, \r\rGood question.  \r\rDiabetes in pregnancy is typically understood to be a result of the insulin resistance that comes from the placenta.  The insulin resistance becomes quite marked mid to late second trimester, and will continue to progress until the baby is delivered (when the placenta is expelled).   This is why some women have to go on medication (typically insulin) to control their blood sugar during pregnancy (despite their best efforts with diet).\r\rFor some women gestational diabetes goes away after delivery of the baby.  For other women, it doesn't and they may subsequently be diagnosed with either type 2, or adult onset type 1 diabetes soon after the pregnancy (ie. the pregnancy triggered overt diabetes).. \r\rIt will be important to monitor blood sugars after the delivery of your baby to make sure that blood sugars are returned to normal. \r\rEven if sugars are normal, some women who had gestational diabetes, may later go on in later years to develop either type 1 or type 2. \r\rDiabetes can be well managed with diet (lower carb), exercise, weight management, and medications (if required). \r\rI hope this response is useful to you.  Best wishes to you and your wife for the arrival of your second child."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14331415"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}