{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-diabetes/show/2954106"
    },
    {
      "USER_NAME": "lil_misss23"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/1878414"
    },
    {
      "POST_TITLE": "Gestational diabetes"
    },
    {
      "POST_BODY": "The hospital just called to say i have gestational diabetes. Im sitting here crying. I dont even understand what it is exactly. Im only 15 weeks. Can someone give me more info please."
    },
    {
      "POST_DATE": "2017-01-23T00:27:08-06:00"
    },
    {
      "POST_ID": "2954106"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "RapunzelLove"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18703394"
            },
            {
              "RESPONSE_BODY": "Ow i m sorry :( that s pretty annoying but don t cry it s for tje good of the baby and u won t gain too much weight. U ll have insuoine and no sugar aloud but i don t know what exactly happens ... Every patient is different and youe Dr will explain everything to u.."
            },
            {
              "RESPONSE_DATE": "2017-01-23T00:37:29-06:00"
            },
            {
              "RESPONSE_ID": "14107011"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "abbifa83"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18950405"
            },
            {
              "RESPONSE_BODY": "It means that your body either isn't producing big enough insulin to control your blood sugar, or that your body isn't responding properly to the insulin that it's producing. You will be put onto a low sugar diet, asked to monitor your own blood sugar levels and possibly given medication, either on way of tablets or if needed, insulin injections. \nTry not to worry, the hospital will explain everything in detail to you and help to get used to the new lifestyle that you will have to follow between now and when your baby arrives. GD usually disappears after birth"
            },
            {
              "RESPONSE_DATE": "2017-01-23T00:50:24-06:00"
            },
            {
              "RESPONSE_ID": "14107022"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "BeccaNutter"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19254356"
            },
            {
              "RESPONSE_BODY": "Hello, I had GD with my first. I guess mine wasn't that bad they just had me eat healthier, I didn't have to take insulin shots just a much stricter/healthier diet. Which isn't a bad thing! Try not to stress about they should set you up an appointment with a nutritionist and they'll explain everything. This doesnt mean your baby isn't healthy! Might be a little bigger but still healthy! My son was 8.2 not terrible lol"
            },
            {
              "RESPONSE_DATE": "2017-01-28T23:31:34-06:00"
            },
            {
              "RESPONSE_ID": "14111596"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi, \nGestational diabetes is not your fault.  it happens to some women.  However, it is  now up to you to learn how to manage it. \n\nGiven that you are only 15 weeks pregnant, it is very likely that you will be given insulin to control your blood sugars. \n\ni would also recommend that you look into lower carb eating (dieticians typically recommend higher carb, but lower carb is also an option, and will make controlling your blood sugar easier). \n\nPlease come back and tell us how you're going and also ask more questions.  We have lot's of experience here between us."
            },
            {
              "RESPONSE_DATE": "2017-01-31T00:41:01-06:00"
            },
            {
              "RESPONSE_ID": "14112989"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "stawibaby"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11872994"
            },
            {
              "RESPONSE_BODY": "I was crying to when I found out I had it. It *****. But it is incredible how easy it is to maintain a healthy diet when you know your baby needs it. I am eating per diet that was recommended and drinking applied cider vinegar with mother with water at least 3 times a day. I am measuring my glucose and it has been normal. Without apple cider vinegar I had to take the pill.\nBest of luck, and don't panic, stress raises the blood sugar apparently..."
            },
            {
              "RESPONSE_DATE": "2017-02-08T06:43:08-06:00"
            },
            {
              "RESPONSE_ID": "14118892"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Sutie247"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20105057"
                    },
                    {
                      "COMMENT_BODY": "How much apple cider vinegar are you putting in your water?"
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14149887"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}