{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2008178"
    },
    {
      "USER_NAME": "baby2014"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5549102"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "What week does the gestational diabetes test take place? I don't remember. I'm not looking forward to it either. \r\rI haven't been to the doctor in 9 weeks I'm already scared I'm going to be fussed at, but I have a legitimate reason. I haven't had the money for the appointments every time I've scheduled them. Something always seems to come up. I feel my little man kicking around everyday and I did have an ultrasound so I know he's okay. Another reason I don't really want to go is because I had a horrible experience with the doctor during my last pregnancy. He didn't warn me that he was going to check my cervix and just jammed his fingers up in my hooha unexpected and it hurt badly then he was a Smarty pants and said it shouldn't hurt considering I know the thing that got you pregnant is bigger than my finger. I had not had sex in almost the whole 9 months. My child's head was already in position. I had preeclampsia. And I hurt regardless of the size! Anyhow I had to be induced after a 24 hour urine test. I wasn't but 35 weeks but my little boy did wonderful.  \r\rSorry off subject. With this pregnancy I've felt great and haven't had worries or scares as I did with my last. I feel like everything is OK. My last pregnancy I knew something was going on I guess my instincts were kicking in. Sorry so long."
    },
    {
      "POST_DATE": "2013-09-11T22:08:29-05:00"
    },
    {
      "POST_ID": "2008178"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "mrselmore1206"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5104126"
            },
            {
              "RESPONSE_BODY": "I didn't have mine til I was 28weeks"
            },
            {
              "RESPONSE_DATE": "2013-09-11T22:19:15-05:00"
            },
            {
              "RESPONSE_ID": "9475437"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pupalu"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/6073732"
            },
            {
              "RESPONSE_BODY": "You take the gestational diabetes screening between 24-28 months. I just did mine yesterday. \r\rAlso, if you're in the US you're eligible for Medicaid. Pregnant women without health insurance can get free prenatal care all the way through as well as a free delivery. And if you do have health insurance your prenatal visits should be free. I would also look into finding another Dr. The last thing you need is someone making you feel bad or ashamed when they're supposed to be helping you."
            },
            {
              "RESPONSE_DATE": "2013-09-11T22:45:15-05:00"
            },
            {
              "RESPONSE_ID": "9475515"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "mrsreeder2be"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/2004517"
            },
            {
              "RESPONSE_BODY": "I had mine yesterday, Ill be 28 weeks on sat."
            },
            {
              "RESPONSE_DATE": "2013-09-11T23:14:43-05:00"
            },
            {
              "RESPONSE_ID": "9475574"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}