{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-diabetesnew-lifestyle/show/2271398"
    },
    {
      "USER_NAME": "Emlue"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8488204"
    },
    {
      "POST_TITLE": "Gestational diabetes...new lifestyle"
    },
    {
      "POST_BODY": "Hey mommas! Anyone out there diagnosed with GD? I was recently diagnosed and wud love to share experiences and give/get support from others in the same position. \rHow have u been feeling?\rAre you satisfied with ur new diet?\rDo u have a full understanding of ur condition?\rHow are ur blood sugar levels so far?\rHow is baby doing?\r\rPlease share and ask questions u want me to answer."
    },
    {
      "POST_DATE": "2014-08-15T17:01:19-05:00"
    },
    {
      "POST_ID": "2271398"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "smileymonn89"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8635198"
            },
            {
              "RESPONSE_BODY": "I had gd last pregnancy this time i dont praise God \r\rI just diet controlled mine i hated the tiny portions and always felt hungry so just filled up on water and healthy snacks \r\rMy sugar levels took me few weeks to figure out what was good and what was bad some food you think is really good is actually worse then you think.\r\rMy baby boy was born via emerg csec after failing to progress i was induced with him he didnt want to move :( 26 hours of labour then the csec produced a very healthy 10lb 3 oz baby boy He did however have to have a glucose dril in for 24-48 hrs to stabalise his sugars."
            },
            {
              "RESPONSE_DATE": "2014-08-15T17:10:32-05:00"
            },
            {
              "RESPONSE_ID": "10929429"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "deltagreen9913"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7664009"
            },
            {
              "RESPONSE_BODY": "I wss diagnosed with gd at 26 weeks, i'm 31 weeks now. It's taken some adjustment. Some days are better than others. I've been able to control it with diet. I eat 6 small meals/snacks throughout the day. I feel like i eat ALL THE TIME. Baby is doing great. Just got an 8/8 on a biophysical profile (which i had because i also have the onset of preeclampsia)."
            },
            {
              "RESPONSE_DATE": "2014-08-15T18:10:37-05:00"
            },
            {
              "RESPONSE_ID": "10929762"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "jcheeks22"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7642836"
            },
            {
              "RESPONSE_BODY": "I have GD and its diet controlled. I walk about 20-30 min a day. It stinks bc I want to eat whatever comes to mind but as long as you eat veggies and lean meats it can be controlled.  I was obsessing in the beginning but ive lost weight and feel better so ill deal with it until she gets here! Good luck, dont stress"
            },
            {
              "RESPONSE_DATE": "2014-08-15T19:51:35-05:00"
            },
            {
              "RESPONSE_ID": "10930282"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Emlue"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8488204"
            },
            {
              "RESPONSE_BODY": "Thanks ladies...I'm struggling with this diet so much! I'm 34wks and I've only gained 14lbs this entire pregnancy n I'm afraid the diet will have me losing weight since the portions are so small And I'm always starving!!!  I am already on the smaller side and my doc asked me to put on some fat and at least a pound a week, then I got diagnosed... I can't wait to see my doc about my nutritionist! Lol  I'm trying different things tho and seeing how my blood sugar reacts and so far my readings have been good"
            },
            {
              "RESPONSE_DATE": "2014-08-16T23:14:41-05:00"
            },
            {
              "RESPONSE_ID": "10937189"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "shockwave7816"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9405924"
            },
            {
              "RESPONSE_BODY": "I just started insulin. :( so yep. I was doing good with the diet but my body needs help with the sugar. I'm bummed"
            },
            {
              "RESPONSE_DATE": "2014-08-16T23:43:37-05:00"
            },
            {
              "RESPONSE_ID": "10937315"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "amysh"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7398322"
            },
            {
              "RESPONSE_BODY": "38 weeks pregnant I have had diabetes since I was a teen. my advice to you ladies is alot of protein rice foods exspecaily if you are put on insulin and educate yourself.  Dont get confused just because its a healthy food doesnt make it diabetic safe. Fruit is loaded with natural sugar. I wish you ladies the best and healthy babies."
            },
            {
              "RESPONSE_DATE": "2014-08-17T00:40:43-05:00"
            },
            {
              "RESPONSE_ID": "10937547"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "shockwave7816"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9405924"
            },
            {
              "RESPONSE_BODY": "Omg. All i want right now is an orange. Torture. :("
            },
            {
              "RESPONSE_DATE": "2014-08-17T00:44:47-05:00"
            },
            {
              "RESPONSE_ID": "10937561"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "jess_v"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10135748"
            },
            {
              "RESPONSE_BODY": "I've had diabetes my entire life this is my first pregnancy and even thou I've been on this diet forever these past couple months have been the real test! All I ever want is pizza, fries, and a milkshake ugh"
            },
            {
              "RESPONSE_DATE": "2014-08-17T01:00:23-05:00"
            },
            {
              "RESPONSE_ID": "10937593"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "MLP04"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9960560"
            },
            {
              "RESPONSE_BODY": "I found out i had gd in the begining of my pregnacy. I was probably 6 or 7 weeks.  It was tough in the begining especially with all the cravings and felt hungry most the time like an hour after ive eaten. To help with that though u should eat the free foods that u can that does not contain carbs. Im a cucumber gal so i would eat that all day when im feeling unsatisfied. I am now 37 weeks and have 15 days to go. Yay!"
            },
            {
              "RESPONSE_DATE": "2014-08-17T01:25:25-05:00"
            },
            {
              "RESPONSE_ID": "10937671"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "CrysyMarie87"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8836040"
            },
            {
              "RESPONSE_BODY": "I just found out at 32wks and I am now 35 wks I was very upset when I first found out bc I didn't have it before the pregnancy but I knew I had to what was right for my princess my sugars weren't that bad to begin with it's still not good at all to be diabetic. But I eat about 5 to 6 times a day and I preck my self 4 times a day once in the morning when I first wake up , and then two hrs after I eat breakfast and two hrs after lunch and two after dinner !! And it ***** but It's been pretty good it's making me keep my sugars in line I'm not on any insulin or anything just dieting and I definitely sometimes wanna eat way more than what I can eat lol and all I drink is hella water or sometimes when I want a little flavor I'll add a little bit of Crystal Light! But I look at all the labels OMG imma worry bug. The lady scared the crap outta me tho she seen a lady that had gestational diabetes not do what she was suppose to and her baby died at 38wks I couldn't even imagine but there gonna also induce me at 39wks thank god my princess is healthy though pray for every one you mommies including myself 26 more days to go!! ☺️"
            },
            {
              "RESPONSE_DATE": "2014-08-17T01:25:48-05:00"
            },
            {
              "RESPONSE_ID": "10937673"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "DraevinMark"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10055259"
            },
            {
              "RESPONSE_BODY": "I can't seem to eat 4-6 times a day in small portions. Not saying I divulge in big portions either. I have my limits with rice etc...but my sugar blood is always high 130's :( I'm taking metformin now 1000mgs and have a monitor to check daily. I'm afraid my baby will be big and I'll end up having to have a c section. :("
            },
            {
              "RESPONSE_DATE": "2014-08-17T01:44:19-05:00"
            },
            {
              "RESPONSE_ID": "10937737"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "JA_Fulani"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8664876"
            },
            {
              "RESPONSE_BODY": "What are the symptoms of  GD?"
            },
            {
              "RESPONSE_DATE": "2014-08-17T01:49:25-05:00"
            },
            {
              "RESPONSE_ID": "10937751"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "MLP04"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9960560"
            },
            {
              "RESPONSE_BODY": "I find that walking after my meals really helps me out. I usually walk 15 to 30 mins but if i cant walk that long i Walk for aleast 10 to 15 mins. Also make sure you are eating ur snacks. They really help."
            },
            {
              "RESPONSE_DATE": "2014-08-17T13:10:36-05:00"
            },
            {
              "RESPONSE_ID": "10939841"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Star3789"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7545588"
            },
            {
              "RESPONSE_BODY": "There r no symptoms thats y they test all of us for it."
            },
            {
              "RESPONSE_DATE": "2014-08-17T13:39:29-05:00"
            },
            {
              "RESPONSE_ID": "10939980"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "amysh"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7398322"
            },
            {
              "RESPONSE_BODY": "Jess_v did you have a large baby the first time? My childhood friend has had diabetes since she was 3years old both of her children were over 10lbs. I got lucky with my first son he was 7lbs 12oz at birth but this pregnancy has been so much harder and they are estimating my son to be 8-10lbs! (Thank god for c sections!)"
            },
            {
              "RESPONSE_DATE": "2014-08-17T20:36:58-05:00"
            },
            {
              "RESPONSE_ID": "10942254"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}