{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes--help-me/show/2388389"
    },
    {
      "USER_NAME": "aliliffers111"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9554815"
    },
    {
      "POST_TITLE": "gestational diabetes!  help me"
    },
    {
      "POST_BODY": "Okay I went to midwife for my 1 hour test. I got 174. I dont get how this possible.  I eat somewhat healthy not a lot of meat but eggs a lot. I exercise everyday I feel better than I have in a LONG time. How did I get gestational diabetes?  About 2 hours before the test I ate egg, peppers, onion,  and a little salt together and water. Is that what messed with it. I do not want to take the 3 hour test! I fainted and threw up last test from the shot let alone the next one where I dont eat. The drink they gave me really messed with my ADD I couldn't concentrate.  Someone help me!"
    },
    {
      "POST_DATE": "2014-11-26T17:24:46-06:00"
    },
    {
      "POST_ID": "2388389"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "mummainoz"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9110656"
            },
            {
              "RESPONSE_BODY": "My neighbour was the same way. She is so thin and eats so well but during pregnancy her body just really struggled to break down complex carbs and refined sugars. She was really upset when she had to use the insulin. But her dr explained it wasn't a reflection on her or necessarily her diet, it was just the strain the pregnancy put on her body."
            },
            {
              "RESPONSE_DATE": "2014-11-26T17:49:55-06:00"
            },
            {
              "RESPONSE_ID": "11585005"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Tati107"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9277232"
            },
            {
              "RESPONSE_BODY": "Eating before the test probably did mess up the teat a bit. I know for my test I was required to be fasting. I did it on Monday. Can't wait to see find out my result. I had GD with my second pregnancy. Just make sure you eat healthy and check your sugar levels. As long as you have that taken care of you should be fine"
            },
            {
              "RESPONSE_DATE": "2014-11-26T17:56:04-06:00"
            },
            {
              "RESPONSE_ID": "11585039"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}