{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-diabetes-snd-birthibg-options/show/2791379"
    },
    {
      "USER_NAME": "shanriya"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15054692"
    },
    {
      "POST_TITLE": "Gestational diabetes snd birthibg options"
    },
    {
      "POST_BODY": "I am diagnosed for gestational diabetes at week 23. Is it possibke to have natural birth? Or is it only ceaserian birth possible?"
    },
    {
      "POST_DATE": "2015-11-19T23:36:47-06:00"
    },
    {
      "POST_ID": "2791379"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hello,\nit certainly is possible and recommended to have a natural birth with gestational diabetes.  What is most important now and for the rest of your pregnancy is that you have excellent blood sugar control (lower carb diet, exercise, medications, if necessary).  With this approach and with excellent blood sugars your baby will be normal sized and is at no more risk than the baby of a woman without diabetes.\n\nI have had 2 babies while having the diabetes.  The first was a natural delivery.  The second we planned for and tried to have a natural delivery, but it ended up a caesarian for reasons totally unrelated to my being diabetic.\n\nHope this helps you."
            },
            {
              "RESPONSE_DATE": "2015-11-20T23:03:54-06:00"
            },
            {
              "RESPONSE_ID": "13481946"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "shanriya"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15054692"
            },
            {
              "RESPONSE_BODY": "Thanks super_sally888. I will work on my sugar level thro diet and exercise. Thanks for your kind words."
            },
            {
              "RESPONSE_DATE": "2015-11-21T01:03:03-06:00"
            },
            {
              "RESPONSE_ID": "13482189"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi Shanriya,\n\nYou are very welcome.  Please do post if you have further questions or concerns.\n\nAre you on any medications or just trying to manage with diet and exercise?\n\nAs the pregnancy progresses you will have increasing insulin resistance.  This is normal.  However, it will also mean that your blood sugar will become harder to control.  If you can no longer manage with diet / exercise, then injected insulin is the best choice.  This is not nearly as bad as it sounds, and it is the best possible tool to get normal blood sugars."
            },
            {
              "RESPONSE_DATE": "2015-11-22T23:35:48-06:00"
            },
            {
              "RESPONSE_ID": "13486289"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "shanriya"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15054692"
            },
            {
              "RESPONSE_BODY": "Currently managing with diet and exercise. Also monitoring the sugar level everyday helps. But like u said i am noticing increasing sugar levels with the same diet. Having appointment with the doctor in a week. Hearing from experienced mums is a great thing. Love <3"
            },
            {
              "RESPONSE_DATE": "2015-11-23T00:13:05-06:00"
            },
            {
              "RESPONSE_ID": "13486376"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "You can reduce carbs further, if you need, while eating plenty of veges, quality protein and healthy fats.  Your baby doesn't detect what you eat, only what your blood sugar is affects it.  The nutrients (fats and proteins) from your diet and vitamins and minerals are important.  But these can come from many sources other than grains and starches.  \n\nMy insulin resistance was worst in the morning, so my breakfast was usually eggs with cheese, and maybe some green veges.  Lunch and dinner were meat and veges.   I found I could not eat fruit as it also raised my sugar quickly.\n\nuse your meter to work out what meals / foods work and which don't."
            },
            {
              "RESPONSE_DATE": "2015-11-23T19:38:56-06:00"
            },
            {
              "RESPONSE_ID": "13488770"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "shanriya"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15054692"
            },
            {
              "RESPONSE_BODY": "Yes. Replacing grains and starch is a challenge. But i ll learn to eat more veggies. My fasting sugar seems to be high.But after food its getting controlled. So i am guessing its the dinner thats causing this. Also No physical activity after dinner. I am not having early dinner. Eating once at 6pm and later again at 9 pm. Learning to use the meter now. Will work on the food vs sugar level. Thanks super_sally888. Love <3"
            },
            {
              "RESPONSE_DATE": "2015-11-24T03:34:52-06:00"
            },
            {
              "RESPONSE_ID": "13489409"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "The fasting sugar is high, because in response to the overnight fast your liver puts out sugar.  also insulin resistance is often higher in the mornings compared to other times of the day.  This may be helped by eating a small meal just before bed time.  This meal should be mostly protein / fats.  \n\nStarting on a slow acting insulin at bed time can also help with the fasting numbers.   Please do discuss with your doctor.  \n\nAn early morning walk may also help get numbers down more quickly.  Eat a small snack before your exercise (again mostly protein / healthy fat) as the food should also help trigger your body to bring the blood sugar down."
            },
            {
              "RESPONSE_DATE": "2015-11-24T20:30:13-06:00"
            },
            {
              "RESPONSE_ID": "13491341"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}