{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/plz-replyim-to-much-worried--/show/2575965"
    },
    {
      "USER_NAME": "rabab_malik"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11393481"
    },
    {
      "POST_TITLE": "plz reply..im to much worried :-("
    },
    {
      "POST_BODY": "Hi im ftm im in my 34 weeks.i had my glucose test today and having 218 sugar level means its high.is this harmful for me and my baby ?what should i do any mothers who had the same experience.my doc said i will have c section coz of low lying placenta..i am too much worried.plz help."
    },
    {
      "POST_DATE": "2015-04-30T16:20:59-05:00"
    },
    {
      "POST_ID": "2575965"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "hb2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11532562"
            },
            {
              "RESPONSE_BODY": "Trying changing diet a little and see if it helps but I am also noticing with mine as well since I was about 30 weeks mine has been climbing up even tho I did change my diet. My doc said it could be due to the anxiety most new mommys get when this close to delivery.. but she has me keeping an eye on it as well. As far as little one is concerned he will probably be checked when born and they can thru withdrawal when born.. but try not to stress over it I know it's hard not to but try to relax ask your doc what you gonna be doing for the next step :) good luck and we are almost to the finish line and get to meet our little ones :)"
            },
            {
              "RESPONSE_DATE": "2015-04-30T17:05:39-05:00"
            },
            {
              "RESPONSE_ID": "12529557"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "mrs_remer"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11242379"
            },
            {
              "RESPONSE_BODY": "Go to pinterest.com search gestational diabetes meal plan. Lots out Good ideas"
            },
            {
              "RESPONSE_DATE": "2015-04-30T17:30:31-05:00"
            },
            {
              "RESPONSE_ID": "12529721"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "GeekMom1213"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7283364"
            },
            {
              "RESPONSE_BODY": "I'm very surprised that you didn't get the testing done until now. I was diagnosed with gestational diabetes at 27 weeks and have been on medication to regulate my blood sugar since a week after that. If GD is kept under strict control (with just dietary changes or a combination of diet and medication, monitored by finger stick blood sugar testing generally done four times daily) babies can be born perfectly healthy. Uncontrolled diabetes can result in complications, some of them serious. Your doctor should be in touch with you very soon to talk about what your next steps should be."
            },
            {
              "RESPONSE_DATE": "2015-04-30T17:46:02-05:00"
            },
            {
              "RESPONSE_ID": "12529847"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}