{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/coming-early/show/2483116"
    },
    {
      "USER_NAME": "kthomp14"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9949093"
    },
    {
      "POST_TITLE": "coming early?"
    },
    {
      "POST_BODY": "I'm almost 35 weeks and measuring almost 37. Do you guys think I'll end up being induced early? I have an ultrasound in 2 weeks."
    },
    {
      "POST_DATE": "2015-02-26T10:20:22-06:00"
    },
    {
      "POST_ID": "2483116"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "kthomp14"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9949093"
            },
            {
              "RESPONSE_BODY": "Bump..."
            },
            {
              "RESPONSE_DATE": "2015-02-26T19:11:30-06:00"
            },
            {
              "RESPONSE_ID": "12083508"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "How good is your blood sugar control?\nThe problem with babies of mums with GD is that they can be big for gestational age, but they are also immature.  Ie. They can be big but their lungs are not as developed.\n\nit will really depend on your doctor if they want to induce early.  However, it is generally not considered wise to induce before 38 weeks unless there is a clear medical reason.. \n\nThe best thing I could recommend for the next 2 weeks is make sure you have excellent blood sugar control to avoid baby growing excessively from your extra sugar."
            },
            {
              "RESPONSE_DATE": "2015-02-26T19:48:05-06:00"
            },
            {
              "RESPONSE_ID": "12083750"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "kthomp14"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9949093"
            },
            {
              "RESPONSE_BODY": "Thank you! That's helpful! I'm pretty good at controlling it. If there's a problem it's usually that I'm just a little low. At the last ultrasound the baby was almost 2 pounds heavier than he should have been at that week."
            },
            {
              "RESPONSE_DATE": "2015-02-26T20:13:56-06:00"
            },
            {
              "RESPONSE_ID": "12083919"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\n\nultrasounds are also not terribly accurate at predicting weight.  Do not let the doctor induce your baby just because he may be a little heavier.  He may not be.\n\nIf your blood sugar control is excellent  (a little low is less problem than consistently high, and if you are checking frequently  you can catch and manage lows) then there is no reason to induce early.\n\nI have a friend who was advised to have a C-section because based on the ultrasound they thought she would have a 9lb baby.  The baby once delivered by cesarian was only 7 1/2 lbs.    You can also research on the accuracy of ultrasounds and you will see that they become less and less accurate as the pregnancy proceeds.\n\nYou should also look at whether you or your husband were large babies (ask your Mums), as being larger at birth can also run in families and is not necessary diabetes related."
            },
            {
              "RESPONSE_DATE": "2015-02-26T22:46:27-06:00"
            },
            {
              "RESPONSE_ID": "12084790"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "kthomp14"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9949093"
            },
            {
              "RESPONSE_BODY": "That's interesting. Thanks for the info! Yeah I really don't have any big problems controlling my sugar so I feel good about his health. My doctor hasn't mentioned inducing yet so maybe she'll encourage 40 weeks. I was about 8 pounds when born but my husband is a twin and he was born premature at 5 pounds. So genetically I wouldn't think this baby would be large."
            },
            {
              "RESPONSE_DATE": "2015-02-27T00:41:16-06:00"
            },
            {
              "RESPONSE_ID": "12085316"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}