{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2314767"
    },
    {
      "USER_NAME": "pogana13"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8592656"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "I was diagnosed with this about a week and a half ago.  I get that it is temporary but I'm struggling to stay sane throughout it. Anyone else about ready to lose it?  I seriously break down and cry once a day because I feel like I'm always hungry.  This is my third pregnancy and it's been one thing after another with this one spotting for a month, morning sicknesses for three months and now this.  In just ready to get my life back to normal.  I'm still doing the diet plan the doctor gave me cause I love my daughter but I just have no clue how much more I can take."
    },
    {
      "POST_DATE": "2014-09-20T09:11:19-05:00"
    },
    {
      "POST_ID": "2314767"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Duenov2014"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8863253"
            },
            {
              "RESPONSE_BODY": "I have it also. And like u this pregnancy has gone the same way except I was sick for 6 months. I don't follow the diet plan but I Did cut out sugary drinks and drank tons of water. My number are fine I run below 100 most of the time. My daughter is 4lBs 4oz. The only thing that is problematic for me now is having carpal tunnel and it's even killing me to write this long comment"
            },
            {
              "RESPONSE_DATE": "2014-09-20T09:27:04-05:00"
            },
            {
              "RESPONSE_ID": "11174054"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "krissydoo"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9618489"
            },
            {
              "RESPONSE_BODY": "I know exactly how you feel. Ive been on the diet for 2 months now and cannot wait to eat whatever I want again. I still cry almost everyday but we just need to keep strong. Think about all the yummy food we can eat after birth! This pregnancy had been a nightmare with constant nausea, spd and diabetes."
            },
            {
              "RESPONSE_DATE": "2014-09-20T09:32:05-05:00"
            },
            {
              "RESPONSE_ID": "11174075"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pogana13"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8592656"
            },
            {
              "RESPONSE_BODY": "Thanks ladies sometimes I feel like the only one going through this breakdown.  Everyone else I have talked to us like oh it will be OK it's only temporary and I wanna say OK let's take away something you really want for 10 weeks you would lose it too.  Your right though it is going to be glorious once we do get to have whatever we want."
            },
            {
              "RESPONSE_DATE": "2014-09-20T09:38:06-05:00"
            },
            {
              "RESPONSE_ID": "11174114"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Candy_T"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7106406"
            },
            {
              "RESPONSE_BODY": "I had GD during the last trimester of my pregnancy and was so devastated/scared that I no longer wanted to eat. I thought it was the most traumatic experience but you don't have to stop eating what you like, just portion control, carb count (which *****) and tons of water. My dietician was very helpful and provided resources to help me through it. Don't be like me and go crazy on junk food after delivery, lol. I eat 8 chocolate chip cookies almost every day now, trying to make up for lost time, lol . :P"
            },
            {
              "RESPONSE_DATE": "2014-09-20T09:46:34-05:00"
            },
            {
              "RESPONSE_ID": "11174158"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Candy_T"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7106406"
            },
            {
              "RESPONSE_BODY": "Oops, *which s u c k s*"
            },
            {
              "RESPONSE_DATE": "2014-09-20T09:47:18-05:00"
            },
            {
              "RESPONSE_ID": "11174160"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "preggerswithmyfirst"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9983629"
            },
            {
              "RESPONSE_BODY": "I have it also and struggled with it at first. I talked to a dietician and now I feel much better about it. My doctor made it sound like I could never again eat a carb which is totally not true. The diet isnt all that bad. It ***** when I want desert or something like that. But I have been craving meat,  which is carb free anyway! Good luck to you I know its hard!"
            },
            {
              "RESPONSE_DATE": "2014-09-20T10:00:21-05:00"
            },
            {
              "RESPONSE_ID": "11174223"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "AmandaPanda85"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10204841"
            },
            {
              "RESPONSE_BODY": "I was diabetic before pregnancy so I had to follow the diet even more strictly since I was scared to death about complications. I found out I was pregnant at 6 weeks and before pregnancy I'd cheat all the time. But even till this day I'm still starving. Lol. I can't wait my 2 and half hours for my next snack or meal lol. It's all about porportions. One thing that helped was my doctor said it's okay to go over on protein and veggies. Just stick within range of the carbs since that's what spikes your sugar more. So I added a salad to every lunch and dinner just cuz I feel I need to eat more. Plus the additional veggies on my plate. And usually try to stick to lean meats. I serve a portion and a half. Sometimes 2. My weight has stayed stable and my sugars have been great. Oh and lots of water! I know it's so hard but it's something we just have to do. I hope the time Flys for you :)"
            },
            {
              "RESPONSE_DATE": "2014-09-20T10:09:19-05:00"
            },
            {
              "RESPONSE_ID": "11174280"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pogana13"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8592656"
            },
            {
              "RESPONSE_BODY": "I'm glad I posted this because it truly helps to have others that are going thru this as well.  Meats wouldn't be a problem normally and I'm pretty much forcing myself to eat it, but ever since I have been pregnant this baby just did but like meat lol it's been all carbs with her.  But really thank you ladies you have all been helpful."
            },
            {
              "RESPONSE_DATE": "2014-09-20T10:20:59-05:00"
            },
            {
              "RESPONSE_ID": "11174376"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Tanjat"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7751549"
            },
            {
              "RESPONSE_BODY": "You can still eat plenty of vegetables and protein foods such as meat and eggs.  You don't have to be hungry."
            },
            {
              "RESPONSE_DATE": "2014-09-20T10:23:32-05:00"
            },
            {
              "RESPONSE_ID": "11174393"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}