{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-diabetes-/show/2653496"
    },
    {
      "USER_NAME": "MrsPrior"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11806792"
    },
    {
      "POST_TITLE": "Gestational diabetes.."
    },
    {
      "POST_BODY": "I have just been told at 36 weeks that I have gestational diabetes. My midwife missed my family history in my notes so didn't test me for this at 28 weeks like she should have. I am really worried about what effect this may have had on my baby as it has been unmonitored for nearly 10 weeks! I am having an emergency growth scan tomorrow and meeting with a consultant but I stupidly googled it and have made myself really scared now because of all the complications it can cause so wondered if there were any positive stories from anyone who has gone through it to try and put my mind at ease until I see the consultant tomorrow. \nAnd I feel really selfish for thinking this but now I can't have the birth I planned in an active midwife led birth centre and am going to have to go into  hospital. all along I have been so low risk and constantly been told my pregnancy is running smoothly I was so pleased that I didn't have to go to hospital as I have a bit of a fear of them and now it's all been turned on its head and I only have 4 weeks to get my head around such a massive change to my pregnancy and birthplan. I am gutted. \n\nSorry for the rant I am just struggling to process this so late on in my pregnancy. :("
    },
    {
      "POST_DATE": "2015-06-29T04:13:08-05:00"
    },
    {
      "POST_ID": "2653496"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "PatricksMommy"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12323913"
            },
            {
              "RESPONSE_BODY": "I'm sorry your going through this. It's hard having your mind set on something, especially having your mind set on the moment your gonna meet your beautiful  babe. \nEveryone  I've ever spoken to, birthplan has never gone accordingly.  Once you hear that cry, I promise nothing else will matter :)\nI had gestational  diabetes  with my first at 32 weeks, and this pregnancy  I found put at 14 weeks.  It's a struggle. Especially  I'm doing everything  right, and I still have to take insulin. My frost I was induced  and had to have a c-section.  And this one I'm just opting for the c section.  \nAs long as the babe and I are healthy.  I don't care how we get their :)"
            },
            {
              "RESPONSE_DATE": "2015-06-29T06:37:28-05:00"
            },
            {
              "RESPONSE_ID": "12880265"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Tsipler"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14548857"
            },
            {
              "RESPONSE_BODY": "I was the opposite of you, they tested early for me so I found out at 9 weeks. Just eat healthy (try to lower carbs don't cut out completely, up protein, eat at regular times, don't eat all day long) do light exercise (walks, household chores such as vacuuming, sweeping, and mopping, park far away from store doors so that you have to walk a little further!) and follow what your doctor suggests! Don't focus on the negative aspects, Google will scare you to death! Good luck at your appt, sorry about your birth plan just stay focused on the baby! When it comes to your diet I want to really stress not to go crazy and cut things out completely! You and your baby need carbs and sugars, but just lower the amount! I found it good to eat my proteins and veggies first then eat my carbs, I eat fewer of them that way. I cut out all sugary drinks so the sugar I have is all natural sugars from the food. Just make the changes and stay positive!!!!"
            },
            {
              "RESPONSE_DATE": "2015-06-29T07:26:10-05:00"
            },
            {
              "RESPONSE_ID": "12880405"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hello,\n\nmy first question is how high are your blood sugars?  If they are only slightly high, then the chances of complications / bigger baby are quite low.\n\nFor now, you still have a few weeks left to go.  Control your blood sugar very well in the next few weeks and this should also help reduce your risk. Avoid sweets and sugars, and reduce carbs.  Eat plenty of non-starchy veges and meats (all of which are healthy anyway). \n\nI am also assuming that your midwife hasn't noticed anything else abnormal, so chances are everything is fine.\n\nlet us know.."
            },
            {
              "RESPONSE_DATE": "2015-06-29T20:32:25-05:00"
            },
            {
              "RESPONSE_ID": "12884459"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}