{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes-/show/2756227"
    },
    {
      "USER_NAME": "03firsttimemummy03"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14659567"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "Im 17 and a first time mama and today i found out i had gestational diabetes what will this mean for me and my baby im freaking out please help"
    },
    {
      "POST_DATE": "2015-10-02T03:28:09-05:00"
    },
    {
      "POST_ID": "2756227"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "lily116"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15474120"
            },
            {
              "RESPONSE_BODY": "High blood sugar ur going to have to check ur blood sugar 4 times a day and start eating healthy stuff nothing with sugar or to much sugar I have it too"
            },
            {
              "RESPONSE_DATE": "2015-10-02T04:16:53-05:00"
            },
            {
              "RESPONSE_ID": "13320252"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "elle_101_1"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12501649"
            },
            {
              "RESPONSE_BODY": "Its actually not the sugars you need to watch it is the carbs. All it is is due to the hormones ur pancreas isnt realesing enough natural insulin to help with carbs in bloodstream u have to eat six times a day and take ur sugar levels 4 times a day. Long as u do that and keep them in range and eat only recommended daily intake of each food group u will be fine they will give u all the info u need well are meant to. They will do ultrasounds and monitor bubs size to make sure wont be too big if they think bub will be to big or levels dont reduce they will induce at 38 weeks. Your not alone so dont stress majority of women get it while pregnant."
            },
            {
              "RESPONSE_DATE": "2015-10-02T06:12:32-05:00"
            },
            {
              "RESPONSE_ID": "13320399"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "03firsttimemummy03"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14659567"
            },
            {
              "RESPONSE_BODY": "My midwife git a call from the lab saying my results were 6.4 and anything over 5.5 means you have it turns out the the lady at the lab has wrote my result down backwards and my result was actually 4.6 im so angry and i dont have it but thanks for helping me understand alittle more"
            },
            {
              "RESPONSE_DATE": "2015-10-04T16:02:49-05:00"
            },
            {
              "RESPONSE_ID": "13328614"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}