{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Chromium/show/2950310"
    },
    {
      "USER_NAME": "pregnantchelsea"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18630877"
    },
    {
      "POST_TITLE": "Chromium"
    },
    {
      "POST_BODY": "Has anyone had any experience/success taking the essential element chromium to combat gestational diabetes? I've learned some prenatals already contain it, others do not, and my prenatal doesn't. I've read for type 2 diabetics many have had success lowering their blood sugar with chromium too."
    },
    {
      "POST_DATE": "2017-01-06T16:56:00-06:00"
    },
    {
      "POST_ID": "2950310"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi, \n\nYes, some people find some benefit in adding chromium to help with diabetes.   You can only try it to know.  Please be sure to following dosing instructions if ever you try it and let your Ob-gyne know you are using it, in case he or she has any concerns. \n\nGenerally supplements give minimal benefit to blood sugar management, though they may help some, particularly if there was a deficiency.  The proven ways however include:-\n\n1. Eating lower carb diet and particularly avoiding added sugars and sweetened foods (this is safe during pregnancy - your baby needs your blood sugar to be normal).\n\n2. Exercise.  Walking or other exercise will be very beneficial. \n\n3. Taking medications if and when  your diet and exercise are not enough to manage blood sugars.   Usually in diabetic pregnancy, the medication of choice will be insulin. \n\nYou should also have and use a blood sugar meter to tell you if your sugars are on target and also to guide you in your foods selection (ie. to see which foods raise your sugars and which do not).  Typically fat has no impact on blood sugar (should be natural and unprocessed), protein has moderate and slow effect on blood sugar (if the diabetes is mild may not have any obvious effect), carbohydrates have large effect on blood sugar. \n\nHOpe this helps.  Best wishes for a smooth and healthy pregnancy."
            },
            {
              "RESPONSE_DATE": "2017-01-06T20:54:37-06:00"
            },
            {
              "RESPONSE_ID": "14095115"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pregnantchelsea"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18630877"
            },
            {
              "RESPONSE_BODY": "I've already been put on a low carb diet. My gestational diabetes thus far is controlled with diet and exercise and I test my blood glucose four times a day. I haven't had much trouble keeping my numbers low and steady as long as I follow my diet, however I'm starving. I'm always hungry. And with my diet I can't eat enough to satisfy my hunger. It's absolutely terrible. That's why I read up on supplementing with chromium, thinking pregnancy brought on a deficiency in me, since I don't have any family diabetes, have always been on the smaller side and healthy, and I'm only 24 and caucasian, which are considered low-risk groups for gestational diabetes. Anywho. Never been so hungry in my life. Want to eat but don't want to raise my blood sugars too much to harm baby :)"
            },
            {
              "RESPONSE_DATE": "2017-01-07T13:47:20-06:00"
            },
            {
              "RESPONSE_ID": "14095598"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "Hi, \nIf you are hungry all the time then you need to add fat, which has no impact on blood sugar, and additional protein. \n\nExamples of this will be nuts such as macadamia, cheese, cream, butter, olive oil, extravirgin coconut oil, fatty meats, cream cheese, avocado, natural mayonnaise, greek yoghurt with maybe some added nuts and berries, (check impact on blood sugar) etc..\n\nIt is perfectly fine to eat heaps of fat.  Fat will not affect your blood sugar and will make you feel full. \n\nThe problem many people have when eating 'low carb' is that they don't add enough healthy fats.  Healthy fats are naturally occurring minimally processed fats.  Saturated fats (from meats etc) are also ok - the previous thought that saturated fats are unhealthy is already outdated. \n\nThe unhealthy fats are vegetable oils, transfats (found in processed and baked goods), and fats from commercially deep-fried foods.\n\nHope this response will h elp you."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14096634"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}