{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/diabeties-during-pregnancy-/show/2708971"
    },
    {
      "USER_NAME": "chunkymunky91"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15246619"
    },
    {
      "POST_TITLE": "diabeties during pregnancy"
    },
    {
      "POST_BODY": "Hey yall. Has anyone ever had gestational diabeties? Well my sugar was high when I went to do my 1st test. I was told that it will most likely be high my second test which will be 3 hours. Has anyone ever experienced this? juse please share any experiences. I don't want it to harm myself or my baby. I also don't want it to turn into permenan diabeties after pregnacy. \n\n\nThanks yall in advance!"
    },
    {
      "POST_DATE": "2015-08-12T03:03:52-05:00"
    },
    {
      "POST_ID": "2708971"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "hailz91"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/971967"
            },
            {
              "RESPONSE_BODY": "First of all everywhere deals woth it diffrently...I have gd. Found out last week. If u have it its easy enough to controlle once u get ur head around everything. Its all about what to eat when to eat and excersize.\n\nI had 2 raised levels so i have to check my blood sugar 3 times a day. I still havent quite figured out the portions.\n\nIt usually goes away in most women and if controlled right all will be good with u and baby.\n\nBasically do as ur told. Haha"
            },
            {
              "RESPONSE_DATE": "2015-08-12T03:26:07-05:00"
            },
            {
              "RESPONSE_ID": "13102674"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "savemecooperman"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15346251"
            },
            {
              "RESPONSE_BODY": "Hi, I had GD with my first pregnancy 4 years ago. Found out at 24 weeks I think. It was a little rough trying to get my numbers under control. I was never too high though once I adjusted my diet. Like I got scared when it was 150 but Dr said that wasn't worrisome but try to keep it lower than that for sure. So I tried the pill...didn't help....had to go on insulin. It wasn't really as bad as it sounded to me. I was induced at 39 weeks and have a perfectly healthy little boy. Don't be afraid. It'll be fine. I am pregnant again. Only 9 weeks along and already have GD. So if you have that tendency and want to have another...try your best to stay on the diet even after your baby is born and maybe it will help you not have it if you have another baby. I wish I had. Dealing with it this early is rough."
            },
            {
              "RESPONSE_DATE": "2015-08-19T06:47:30-05:00"
            },
            {
              "RESPONSE_ID": "13135077"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}