{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Dangers-of-gestational-diabetes-test/show/2260024"
    },
    {
      "USER_NAME": "Debie19"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8920201"
    },
    {
      "POST_TITLE": "Dangers of gestational diabetes test"
    },
    {
      "POST_BODY": "Hey ladies! Here is some interesting info on the gestational diabetes test. I personally will be saying no to this test and I hope u all will at least do some research and make an informed decision for you and your sweet baby :) at the bottom I've included websites where I got all of this info. Here are some facts I found: \r\rGlucola test has a sensitivity of 76%. This means that a positive result will correctly identify about 76 out of 100 women who have gestational diabetes (the other 24 would go un-identified and not realize they have gestational diabetes). The specificity of the test is 76%. This means that among 100 women without gestational diabetes, 76 will have a negative result (and 24 women who do not have gestational diabetes will have a positive result!)\r\rThe glucose drink contains BVO or, brominated vegetable oil which is contained in many sodas and prevents the flavor from rising to the top of the drink. \r\rBVO is patented in the US as a flame retardant and is actually banned from soft drinks in Europe and Japan. \r\rResearch has shown that these substances build up in the body as well as breast milk and leave residues that accumulate in the brain, liver and other organs. \r\rBVO has been associated with heart lesions, fatty changes in the liver and impaired growth and developmental development and both animal and human studies have linked BVO to fertility problems, neurological problems and changes in thyroid hormones. \r \r\"In a study with 25,000 women, stillbirth and infant death are such rare occurrences that this study did not have a big enough sample size to look at deaths. However, the authors reported that they did not find any association between infant deaths and gestational diabetes \"(Metzger, Lowe et al. 2008).\r\rThe following statements were included in an ACOG article...\r\r“The U.S. Preventive Services Task Force has concluded that although there is insufficient evidence to recommend universal screening, screening high-risk women may be beneficial.”\r\r“The 50-g, 1-hour laboratory screening test has become widely used…despite the absence of data to demonstrate a benefit to the population as a whole.”\r\r“It should be emphasized that although the evidence is inconclusive that treating gestational diabetes can prevent maternal and fetal complications, universal screening and treatment are widely practiced.”\r\rThat is just SOME of what I've found. I hope all you moms can take the time to do some research and make an informed decision! \r\rHere are some website where I got this info: \r\rhttp://evidencebasedbirth.com/gestational-diabetes-and-the-glucola-test/\r\rhttp://foodbabe.com/2014/05/13/shocking-why-are-doctors-recommending-this-toxic-drink/\r\rhttp://avivaromm.com/dont-drink-glucola-gestational-diabetes"
    },
    {
      "POST_DATE": "2014-08-06T07:30:42-05:00"
    },
    {
      "POST_ID": "2260024"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Debie19"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8920201"
            },
            {
              "RESPONSE_BODY": "Bump"
            },
            {
              "RESPONSE_DATE": "2014-08-06T08:22:47-05:00"
            },
            {
              "RESPONSE_ID": "10866605"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "ConnorAbby0517"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9504989"
            },
            {
              "RESPONSE_BODY": "There's other things you could take instead , like jelly beans , or apple juice ."
            },
            {
              "RESPONSE_DATE": "2014-08-06T08:32:36-05:00"
            },
            {
              "RESPONSE_ID": "10866649"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "missjenni123"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8599274"
            },
            {
              "RESPONSE_BODY": "Most doctors, if you deny the test, will give you a blood glucose meter and have you monitor your blood sugars for several weeks that way"
            },
            {
              "RESPONSE_DATE": "2014-08-06T08:41:31-05:00"
            },
            {
              "RESPONSE_ID": "10866681"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Knucks10"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/2133163"
            },
            {
              "RESPONSE_BODY": "If you're doing research on something I wouldn't suggest any .com websites maybe try .edu or .org but there are other methods with testing besides the drink and I personally wouldn't refuse the test because it would be something any pregnant woman needs to know."
            },
            {
              "RESPONSE_DATE": "2014-08-06T08:50:57-05:00"
            },
            {
              "RESPONSE_ID": "10866727"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Debie19"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8920201"
            },
            {
              "RESPONSE_BODY": "Yea I plan to check my glucose manually every once in a while just to be safe"
            },
            {
              "RESPONSE_DATE": "2014-08-06T11:33:25-05:00"
            },
            {
              "RESPONSE_ID": "10867719"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "boothang8695"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8401343"
            },
            {
              "RESPONSE_BODY": "I have preexisting diabetes whicheans I don't have to do the teat. But if you do have gestational diabetes this test does find it. And yes there are complications that come from gestational diabetes and infant problems.\r\rIf you were to get gd and you don't deliver before 39 weeks there is a higher risk you'll deliver a still born. If your sugars are high there is a greater chance your child will form diabetes among other problems. Some end up with holes in their hearts, mental problems, and or other physical deformities. \r\rUnless you are, or these people writing these articles are a Dr or a nurse, certified and licensed neither you or the people wrighting the articles absolutely know the risks and benefits. The Dr would not give you anything or make you have any teats that they knew would do more harm then good. If the benefits greatly outweigh the risks then they preform these. But if the risks outweigh the benefits they won't risk it."
            },
            {
              "RESPONSE_DATE": "2014-08-06T12:03:25-05:00"
            },
            {
              "RESPONSE_ID": "10867877"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "boothang8695"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8401343"
            },
            {
              "RESPONSE_BODY": "And checking every once in a while doesn't do it. You would have to check a fasting sugar. Before each meal. Two hours after each meal. And before bed. Every day for a week to two weeks"
            },
            {
              "RESPONSE_DATE": "2014-08-06T12:05:11-05:00"
            },
            {
              "RESPONSE_ID": "10867887"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "bonitagirl747"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8470811"
            },
            {
              "RESPONSE_BODY": "I'm glad that she is wanting people to know the small side effects of this test but I personally think that it is irresponsible to put this info out there especially from a .com website. The risks of skipping the test greatly out weight the benefits. Take the test, talk to your doctor if you're concerned and be proactive about your and your baby's health."
            },
            {
              "RESPONSE_DATE": "2014-08-07T12:13:36-05:00"
            },
            {
              "RESPONSE_ID": "10874451"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "melcarin"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7561094"
            },
            {
              "RESPONSE_BODY": "Yeah I don't know why anyone would opt out of a test like this because somebody found one bad report. Your doctor won't do anything that they feel would negatively harm baby or mom. I'm all for the test. Diabetes is a tough thing to have and at least gestational goes away."
            },
            {
              "RESPONSE_DATE": "2014-08-07T12:17:16-05:00"
            },
            {
              "RESPONSE_ID": "10874481"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Lexwizzade"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9632530"
            },
            {
              "RESPONSE_BODY": "GD can really harm a baby! The baby could have tons of birth defects if diabetes is not managed properly and test once an awhile will not show if you need insulin to help further control your sugar. The test may be \"dangerous\" in someway but I have had both a pregnancy with GD and one with preexisting diabetes and my girls are both healthy because i start management early!"
            },
            {
              "RESPONSE_DATE": "2014-08-07T13:05:23-05:00"
            },
            {
              "RESPONSE_ID": "10874735"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}