{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/2nd-pregnancy--1st-ended-in-missed-miscarriage/show/2231882"
    },
    {
      "USER_NAME": "Peyton_13_09"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9215866"
    },
    {
      "POST_TITLE": "2nd pregnancy, 1st ended in missed miscarriage"
    },
    {
      "POST_BODY": "I am trying to stay positive but tomorrow I will be 8wks & 3 days which was when my little angel's heart was estimated to have stopped. I am very worried, I have a dating scan at 9 weeks but I really wanted to get one earlier to give myself some peace but no one had any available spots. My missed miscarriage was a terrible ordeal, I went in to have medical management; the medication and the next day I woke up in labor and hemorrhaged. I ended up passing the baby at home but was rushed into surgery when they found tissue still inside the uterus. \rThis happened on the 26th of February and this pregnancy seems to be going well apart from my symptoms starting to disappear at times. I just really am so frightened about losing this baby, my partner is being supportive but that fear ofggoing for a scan and seeing no heartbeat is very much alive. \rAnyone else been through this? How did you cope?"
    },
    {
      "POST_DATE": "2014-07-10T19:39:10-05:00"
    },
    {
      "POST_ID": "2231882"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "OctoberBaby5"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8509309"
            },
            {
              "RESPONSE_BODY": "Just dont stres about it.. Ive had to miscarriages in the past and the worst thing I did was stress about it so this pregnancy I have been stress free and my baby girl is growing big and healthy at 27 weeks :)"
            },
            {
              "RESPONSE_DATE": "2014-07-10T19:43:14-05:00"
            },
            {
              "RESPONSE_ID": "10708093"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "crissylovebora"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9157001"
            },
            {
              "RESPONSE_BODY": "I had 2 miscarriages and after 3 years of trying to get pregnant I finally am im 14 weeks and 5 days I already seen my baby moving on the ultrasound but im a high risk pregnancy because I have high blood pressure and diabetes so I have 7 different doctors seeing me"
            },
            {
              "RESPONSE_DATE": "2014-07-10T19:50:49-05:00"
            },
            {
              "RESPONSE_ID": "10708135"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "gloriag3Castillo"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7485312"
            },
            {
              "RESPONSE_BODY": "I had a miscarriage on Feb 5. I got pregnant about two months later. I am now 12 weeks, one week passed my last pregnancy. I have heard the heart beat twice. This pregnancy was very different from the last as I have symptoms I didn't last time. I have been worried sick up until this week and haven't been able to enjoy my pregnancy. My only advice it to take it by day and week and take care of yourself. Make sure your vitamins included iron. That is a mistake I made the first time and became anemic."
            },
            {
              "RESPONSE_DATE": "2014-07-10T20:10:55-05:00"
            },
            {
              "RESPONSE_ID": "10708281"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "keara1212"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9171754"
            },
            {
              "RESPONSE_BODY": "I know exactly how yu feel this is my 2nd pregnancy first ended due to a miscarriage as well once I lost my son in November 2013 at 13wks 4days so with this pregnancy I was so scared but once I passed that the worrying started to ease up this pregnancy has been great so far I have a healthy baby an ill be 18wks tomorrow try not to stress it to much everything will be ok just keep your faith an ill keep yu in my prayers btw  congratulations :)"
            },
            {
              "RESPONSE_DATE": "2014-07-10T20:16:36-05:00"
            },
            {
              "RESPONSE_ID": "10708315"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "ExcitedMommy21"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9163191"
            },
            {
              "RESPONSE_BODY": "Same here I had one in 2012 and one last year the day before thanksgiving. Everything seemed fine but I never made it past 8 weeks both times. This time we decided to noy have the stress and wait to get a test done if I started showing signs. We waited and I found out at 9 weeks that was in march im now 25 wks and 6 days. Hes doing amazing and we couldnt be happier. Just try and relax dont let the stress get to you. I know its hard to not think about the first time. I was worried this time again when I got pregnant since it was so close to my last miscarriage. But I hope everything goes well for this baby god is with you just stay calm and think about seeing your lil baby in a couple days at the 9 wk scan"
            },
            {
              "RESPONSE_DATE": "2014-07-10T21:47:14-05:00"
            },
            {
              "RESPONSE_ID": "10708776"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}