{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Just-diagnosed-with-gestational-diabetes-/show/2688355"
    },
    {
      "USER_NAME": "Eleetree"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14975155"
    },
    {
      "POST_TITLE": "Just diagnosed with gestational diabetes"
    },
    {
      "POST_BODY": "I was told that I needed to be at a 90 or below to pass my glucose test and I was told I got a 92. So they told me I have gestational diabetes. I have no idea what foods to make or meal plans I am a really busy person and need help figuring out what to do food wise and what's safe to eat also portions!!! Help please :("
    },
    {
      "POST_DATE": "2015-07-23T11:04:48-05:00"
    },
    {
      "POST_ID": "2688355"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "You will need to get a blood sugar meter and start to monitor your blood sugar 2 hours after eating, and fasting.  You target post eating is < 120.  Portion control, particularly for carbs will be very important to help manage your blood sugar.  using your meter you will be able to work out which foods are ok and in what quantity.  ie. if you are on target after eating then you know what you ate is ok. IF it is not, ie. higher (lower is ok), then you need to reduce the carbs eaten - replace with protein, fats, or different carb that has less impact.\n\nVeges are good for you so make an effort to eat these.  Avoid sweets, cola, juices, limit fruits, small portion only of bread, rice, pasta etc."
            },
            {
              "RESPONSE_DATE": "2015-07-25T00:18:54-05:00"
            },
            {
              "RESPONSE_ID": "13015568"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Mayceee"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14453058"
            },
            {
              "RESPONSE_BODY": "Meet with a nutritionist if you haven't done so. Get a monitor and it'll be trial and error to see what you can and cannot eat or tolerate. If your blood sugars at 2 hours after eating is less than 120 then you are within range. Bedtime snacks are helpful if your fasting morning sugars are running high."
            },
            {
              "RESPONSE_DATE": "2015-09-24T15:21:20-05:00"
            },
            {
              "RESPONSE_ID": "13290679"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}