{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/GD-from-the-beginning/show/2700655"
    },
    {
      "USER_NAME": "SBolton35F"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15137909"
    },
    {
      "POST_TITLE": "GD from the beginning..."
    },
    {
      "POST_BODY": "I'm 25 and 6w2d. My Dr made me take the 1hr test because my daughter was a large baby, I'm overweight and I'm over 25. I failed the 1 hr by 2 points. I went back for the 3 hour test and it has been confirmed. Have any of you had to deal with GD from the beginning of your pregnancy? How did you cope with it?"
    },
    {
      "POST_DATE": "2015-08-04T04:53:19-05:00"
    },
    {
      "POST_ID": "2700655"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\nactually if it is present at the beginning of the pregnancy it is not GD, but rather it is preexisting diabetes.\n\nI had this and was on insulin by 3 months in on my first pregnancy.  Work hard to control  your blood sugar by restricting carbs, exercise, etc.  Don't be scared to take insulin.  Learn as much as you can about blood management so that you and your baby have the best possible outcome.\n\nI managed to control my blood sugar well and had no diabetic complications for either of my two girls who are now 3 and 6.  Btw I am still diabetic and I still use  insulin.\n\nFor a great information sournce I can recommend the book \"Diabetes Solution\" by Dr. Richard Bernstein or his U-tube sessions \"Bernstein Diabetes University\"."
            },
            {
              "RESPONSE_DATE": "2015-08-04T19:48:13-05:00"
            },
            {
              "RESPONSE_ID": "13067993"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "savemecooperman"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15346251"
            },
            {
              "RESPONSE_BODY": "I am 9 weeks pregnant with my second baby and I already have it too. Yes my Dr also told me I must have been a little insulin resistant even before I got pregnant and an a1c test confirmed it. I had GD with my first as well. They tested around 24 weeks. Failed my 1 hour bad enough to where they didn't even do the 3 hour. If you already have it, it's really important to get it under control quick so definitely don't be afraid of insulin. I was with my first but after finding out that it's just putting extra of something your body already produces made me feel better. And whatever it takes to keep the baby healthy is worth it. I haven't started exercising yet but I need to. I'm extremely intolerant to carbs right now. Dr said I could have up to 45g on meals....nope. I can't do it. Numbers are high if I eat 30. So been trying to keep it under 30. Taking insulin just at night right now bc my morning fasting I couldn't control. Hope everything goes well for you! Dr made me feel good. I almost had a break down about it last dr visit...but she told me that mothers with type 1 and poorly managed are the ones that really put their babies in danger. And people who consistently have their numbers sky rocket over 200. But if you're managing it and keeping it below that she said not to worry. So that made me feel better. And one upside to having GD is your baby is monitored way more closely and you get more ultrasounds than a non high-risk."
            },
            {
              "RESPONSE_DATE": "2015-08-19T07:00:23-05:00"
            },
            {
              "RESPONSE_ID": "13135110"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}