{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/1st-trimester/show/2749740"
    },
    {
      "USER_NAME": "Mayceee"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14453058"
    },
    {
      "POST_TITLE": "1st trimester"
    },
    {
      "POST_BODY": "Anyone else diagnosed with GDM in the first trimester?"
    },
    {
      "POST_DATE": "2015-09-24T15:18:48-05:00"
    },
    {
      "POST_ID": "2749740"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi Mayceee,\n\nIf you are diagnosed i the first trimester (I was with my first, in fact my endo tested as soon as I got pregnant and i failed the glucose tolerance test), then it is not gestational diabetes, but rather preexisting diabetes that is uncovered by the pregnancy.\n\nI was very athletic prepregnancy.  I had been tested for diabetes early and come back negative.  But I was on insulin by the time I was 3 months pregnant.\n\nPlease ask any questions you want and I will do my best to answer.\n\nControl your sugar well with insulin, diet and exercise.  You and your baby will be fine.  I now have 2 beautiful girls after 2 diabetic pregnancies."
            },
            {
              "RESPONSE_DATE": "2015-09-29T03:01:17-05:00"
            },
            {
              "RESPONSE_ID": "13307857"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Mayceee"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14453058"
            },
            {
              "RESPONSE_BODY": "Thanks for your reply. I asked my endo regarding pre existing diabetes but I was told that I do not meet criteria for overt diabetes and therefore still fall under gestational. Either way, watching my diet carefully, trying to get exercise. \n\nThanks!!!"
            },
            {
              "RESPONSE_DATE": "2015-10-05T19:22:16-05:00"
            },
            {
              "RESPONSE_ID": "13333305"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "Hi Marcee,  My endo also didn't want to diagnose me as anything other than gestational, even though I was diagnosed in the first few weeks of pregnancy.  However, be aware that you should test after you deliver your baby, as there is a possibility that your numbers will not return to normal after the pregnancy."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "13494041"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi Maycee,\n\nthe fact that it has developed so early will mean that you need to check carefully after pregnancy.\n\nIn my case, I was on insulin by the time i was 3 months pregnant (insulin was such a relief as it allowed me to control my blood sugars well).  I continued with insulin after the pregnancy (much lower dose) through a second pregnancy up to now (7 years later).  I still have very good control and don't have to use too much insulin."
            },
            {
              "RESPONSE_DATE": "2015-10-05T19:48:40-05:00"
            },
            {
              "RESPONSE_ID": "13333359"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Zsinka80"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/16482006"
            },
            {
              "RESPONSE_BODY": "I had diabetes during my 1st preg but fine before and after now im 5 weeks so i thought i pl check 1x a week when it would kick in but the morning before meal was 6.1 already"
            },
            {
              "RESPONSE_DATE": "2015-11-24T03:44:03-06:00"
            },
            {
              "RESPONSE_ID": "13489421"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Zsinka80"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/16482006"
            },
            {
              "RESPONSE_BODY": "Hm it cut half message..i don't remember where to start..should i contact to my doctor? Or just weight and see? My strios r out of date 7/2015 but i guess its still ok to use"
            },
            {
              "RESPONSE_DATE": "2015-11-24T03:45:51-06:00"
            },
            {
              "RESPONSE_ID": "13489425"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\n\nCongratulations on your pregnancy.\n\n6.1 (110) fasting is too high.  You want it to be less than 5.2 (95).\nPlease check your post-eating, you want it to ideally be less than 6.6 (120).\n\nYou need to see your doctor already and as soon as possible, to get started on medication (most likely insulin).  Insulin resistance will increase throughout the pregnancy and it is very important to have excellent control from the beginning - as high blood sugars at this point can affect the development of your baby's organs.\n\nYou can use up the existing strips, it should be accurate enough for now.  You will need to get new ones soon enough.  Adopt a low carb diet (no sweets etc), but get plenty of veges, protein and healthy fats.  Exercise daily.  these will all help, but given your current numbers will not be enough."
            },
            {
              "RESPONSE_DATE": "2015-11-24T20:27:13-06:00"
            },
            {
              "RESPONSE_ID": "13491338"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}