{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2594945"
    },
    {
      "USER_NAME": "Ash11210"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11804146"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "Is that something that I really should worry about?! I've been looking it up but other than having a big baby, I haven't really seen anything bad. Is that really the worst effect or are there other effects of gestational diabetes that I haven't seen?!"
    },
    {
      "POST_DATE": "2015-05-13T17:08:07-05:00"
    },
    {
      "POST_ID": "2594945"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "awic3"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8509224"
            },
            {
              "RESPONSE_BODY": "It could also put extra stress on the baby and he/she will be checked for diabetes when born."
            },
            {
              "RESPONSE_DATE": "2015-05-13T17:34:42-05:00"
            },
            {
              "RESPONSE_ID": "12616904"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Mogpog"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11757703"
            },
            {
              "RESPONSE_BODY": "Well it is diabetes, so that can have complications. But if you do develop it and you watch your diet and follow your doctor's orders then you and baby should be fine"
            },
            {
              "RESPONSE_DATE": "2015-05-13T17:36:37-05:00"
            },
            {
              "RESPONSE_ID": "12616920"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "fagli"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12362678"
            },
            {
              "RESPONSE_BODY": "This is my second pregnancy and I had with first as well, but  it is just diet controlled. And my first baby was an average 7 lbs and didn't have high glucose levels after birth. I think they do exaggerate it a bit too much...so long as your sensible it's nothing to loose sleep over. I had natural v.birth so aiming for another one this time too. Good luck. X"
            },
            {
              "RESPONSE_DATE": "2015-05-13T17:40:52-05:00"
            },
            {
              "RESPONSE_ID": "12616940"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Ash11210"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11804146"
            },
            {
              "RESPONSE_BODY": "Thank you all soo much. I know any health concerns should be taken seriously but I did not want to be excessively worrying when things may not be as bad as I am thinking. I find out in a few days if I have it but I just wanted to make sure it can be controlled as it is still early."
            },
            {
              "RESPONSE_DATE": "2015-05-13T17:51:28-05:00"
            },
            {
              "RESPONSE_ID": "12617007"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "beth2311"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11101712"
            },
            {
              "RESPONSE_BODY": "Ive had gd with all my pregnancies and was able to easily control my levels with a controlled diet. It means saying goodbye to all those yummy carbs and sweets but it is doable. When you have gd and your levels are to high that extra glucose goes to the baby and their body has to work harder to get rid of it. It does make for bigger babies and there are other health risks involved if you don't control your glucose.  But as long as you listen carefully to your drs there's no reason to stress yourself!"
            },
            {
              "RESPONSE_DATE": "2015-05-13T21:38:31-05:00"
            },
            {
              "RESPONSE_ID": "12618449"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Ash11210"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11804146"
            },
            {
              "RESPONSE_BODY": "Ok. Thank you. I just wanted to get some information based on personal experience before I let my mind get into worry more. This is my first child and I just want to be sure baby is healthy."
            },
            {
              "RESPONSE_DATE": "2015-05-14T10:59:07-05:00"
            },
            {
              "RESPONSE_ID": "12621762"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "MSmith2012"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10654789"
            },
            {
              "RESPONSE_BODY": "I had gestational diabetes baby came out almost 3 weeks early at 9 lb 7 oz. His head was to big so it forced me into a csection (which I didn't want). if you don't control your gestational diabetes there is an increase risk for still birth.  And for you you have an increase risk for pre-eclampsia"
            },
            {
              "RESPONSE_DATE": "2015-05-14T11:06:37-05:00"
            },
            {
              "RESPONSE_ID": "12621824"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "ambigates96"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13821473"
            },
            {
              "RESPONSE_BODY": "The baby can have low blood sugar, respiratory distress, and jaundice so you want to take care of yourself especially when it comes to gestational diabetes. I was diagnosed two days ago with this and the baby can have all those issues including high risk of diabetes and obesity later in life."
            },
            {
              "RESPONSE_DATE": "2015-05-14T11:44:28-05:00"
            },
            {
              "RESPONSE_ID": "12622082"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "GeekMom1213"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7283364"
            },
            {
              "RESPONSE_BODY": "I've got GD, I'm on daily medication because it wasn't able to be controlled with strict diet changes alone and I check my sugars four times daily (thankfully the medication has been enough so far and I haven't needed to start on insulin). I've had to start on non stress tests at every appointment and have to get extra ultrasounds to check and make sure my placenta is still functioning efficiently. My midwife told me today they might not be able to let me wait until labor starts naturally if I go overdue, that induction might be necessary. She told me I have an increased risk of having a \"sudden stillborn\" birth from the diabetes. Also that in some cases if the placenta stops functioning properly and baby isn't delivered soon enough that brain damage can result from a lack of oxygen. Lung development may be delayed. \nThere are lots of potential complications. Many women don't end up having trouble but it really is a serious diagnosis and requires close monitoring. Even just having a \"big baby\" carries risks of its own. \nI'm not trying to scare you. But it's not as easy as just \"follow orders\" and \"be sensible\". Even women who strictly adhere to diet and medication orders can end up with complications. It's less likely obviously if it's well controlled. But it doesn't just happen to noncompliant patients. It's just one of those things that you do the best you can, and hope for the best. The chances of a healthy baby are still really good. Catching it early and starting treatment right away is key. \nGood luck."
            },
            {
              "RESPONSE_DATE": "2015-05-14T12:07:30-05:00"
            },
            {
              "RESPONSE_ID": "12622208"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}