{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2454478"
    },
    {
      "USER_NAME": "p_cakesss"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10139144"
    },
    {
      "POST_TITLE": "gestational diabetes???"
    },
    {
      "POST_BODY": "Last month my Dr. told me that baby is measuring big and also that I'm gaining too much weight. \nI went for an ultrasound last month to check if my placenta moved (it had) due to placenta previa...i told the ultrasound tech about what my Dr said and asked her if baby is measuring \"big\"...and she said no, that she's in normal ranges and that she dsnt knw what my Dr is talking about.\nFast forward to earlier this morning, i went to my prenatal appt. Dr mentioned my weight and baby being big again...and told me to take another glucose test because i could have gestational diabetes. \nMy dr only checks baby with measuring tape versus the ultrasound...so i'm more inclined to believe the accuracy of the ultrasound...and as fae as my weight, i'm all stomach! And i always get compliments on how good i look and how well i'm carrying...but, i do knw that the scale dsnt lie lol.\nThoughts??? Personal experiences???\nThanks!!"
    },
    {
      "POST_DATE": "2015-02-03T13:24:37-06:00"
    },
    {
      "POST_ID": "2454478"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "susamor"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5987012"
            },
            {
              "RESPONSE_BODY": "Is this your first baby? How far along are you?"
            },
            {
              "RESPONSE_DATE": "2015-02-03T13:40:27-06:00"
            },
            {
              "RESPONSE_ID": "11937400"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Cass_plus_one"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11784223"
            },
            {
              "RESPONSE_BODY": "My thoughts would be gay new doctor this one seems to be acting kind of weirdmaybe he's hoping to pressure you into a scheduled C-section so that he can deliver your baby on the day he chooses"
            },
            {
              "RESPONSE_DATE": "2015-02-03T13:44:17-06:00"
            },
            {
              "RESPONSE_ID": "11937415"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "susamor"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5987012"
            },
            {
              "RESPONSE_BODY": "With my first pregnancy I didn't know how much I had to eat and went overboard with unhealthy food. I started at 106 lbs and since I was weighing around 130 something when I said I was concerned about how much weight im gaining the doctor kept telling me I was fine and looked fine. Said I was measuring what I needed to. I ended up weighing over 170 lbs by the end and had a 9.6 lb baby. No one even thought I was going to have a big baby. I ended up needing a c section because my labor stopped. A red flag for me should have been that I barely passed the 2nd glucose test I had to retake. Also I never really exercised or tried to eat more healthy. I also felt I looked good most of my pregnancy but the last trimester was when I really gained those pounds even faster. My advice is to eat healthy and exercise."
            },
            {
              "RESPONSE_DATE": "2015-02-03T13:49:25-06:00"
            },
            {
              "RESPONSE_ID": "11937446"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "momMaggie"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10752822"
            },
            {
              "RESPONSE_BODY": "Well the doctor is only measuring your uterus.  They can't really measure the baby from the outside except to guess, but maybe your uterus is measuring big. The ultrasound is definitely a more accurate measure of baby. Also if you're gaining a lot of weight and you're all stomach then it makes sense you're measuring big from the outside. It doesn't mean you have gd, but the doctor probably wants to make sure everything is good and I think it's good to be safe. Then if you don't have it and the u/s shows a healthy baby you know you don't have to worry. I don't know if this is the case, but I would caution you if you're gaining more weight than is normal and you aren't eating healthy it's a good thing to pay attention to.  Not to stop eating or try to lose weight.  Just to be careful from here on about it. But if you and baby are healthy I wouldn't worry."
            },
            {
              "RESPONSE_DATE": "2015-02-03T13:50:11-06:00"
            },
            {
              "RESPONSE_ID": "11937449"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "p_cakesss"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10139144"
            },
            {
              "RESPONSE_BODY": "Susamor: 2nd baby...31 weeks.\n\nI dnt overeat...but, my choices aren't always the healthiest."
            },
            {
              "RESPONSE_DATE": "2015-02-03T13:58:46-06:00"
            },
            {
              "RESPONSE_ID": "11937487"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}