{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2277190"
    },
    {
      "USER_NAME": "jjones2015"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7778528"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "Can anyone give me any kind of information on it?  I go Friday to be tested. But they think I may have it. Not sure what to expect or what I should be experiencing?"
    },
    {
      "POST_DATE": "2014-08-20T15:49:05-05:00"
    },
    {
      "POST_ID": "2277190"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "dominika1980"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10006638"
            },
            {
              "RESPONSE_BODY": "You may not necessarily feel it if it's in the lower range. \nIf you do have it, you will be advised to stick to a diet and if that doesn't control the illness, you will get a choice of tablets or injections. \nI've been on injections for nearly a month now and having some problems due to inability to always eat on time - i work full time - so from next week they may put me on tablets."
            },
            {
              "RESPONSE_DATE": "2014-08-20T15:54:10-05:00"
            },
            {
              "RESPONSE_ID": "10961470"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Nov7thmommy"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9936345"
            },
            {
              "RESPONSE_BODY": "I have it, I'm on insulin, and now that I entered my third trimester is getting high again, so today they increased my intake and if by Monday is still that high, I might get admitted, but for now is low so I hope it works :(("
            },
            {
              "RESPONSE_DATE": "2014-08-20T15:56:18-05:00"
            },
            {
              "RESPONSE_ID": "10961484"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "mommajune"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10202366"
            },
            {
              "RESPONSE_BODY": "I had it with both previous pregnancies\nI'm on number three and sure to have it again.  It's not to bad if you can switch to a healthy diet and exercise as soon as possible, checking your blood sugar constantly is hard and so is controlling your appetite when you decide you want to just eat kind of crazy. I know i love chocolate and noodles, i know your strong enough to keep your sugars under control with eating right and physical activity, if you are not sure you can do it all the time though they have insulin shots to keep your blood sugar down for you and baby!  Good luck!"
            },
            {
              "RESPONSE_DATE": "2014-08-20T15:57:29-05:00"
            },
            {
              "RESPONSE_ID": "10961490"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "mj32215"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9974613"
            },
            {
              "RESPONSE_BODY": "I'm one of those unfortunate enough to have had diabetes prior to becoming pregnant, but the pregnancy has pushed me to being insulin dependent. I have to give myself a shot of insulin 5 times a day and am on a very strict diet. My body is extra sensitive to both the food and the meds. So one wrong thing to eat could send me into the 4-500s, and too much insulin could cause me to fall to 30 and pass out. That happened twice while in the hospital. Its very scary."
            },
            {
              "RESPONSE_DATE": "2014-08-20T17:05:40-05:00"
            },
            {
              "RESPONSE_ID": "10961887"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "jjones2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7778528"
            },
            {
              "RESPONSE_BODY": "I'm currently 27 weeks and 5 days. When I was 16 weeks, I almost passed out, they checked my sugar then and it was fine. But never did the glucose test. I'm actually scheduled for my glucose test Friday. I've been in and out of labor with early contractions. I haven't felt right for a few days, somethings been off. I thought it was my blood pressure so I took my pressure(I work full time ems) and it was fine. I ate my lunch at 11, and around 2 I was still feeling funny. But not quite sure what was wrong so I took my sugar. And I hadn't eaten anything since 11-12 (I had a Pack of crackers because I got nauseated), so I checked my sugar. And it was 171. My sugar is never above 110.  We called the doctors and he said to keep an eye on it and go to l&d if I needed too.  I've been more irritable then normal, peeing more then I should, random massive headaches, and unbelievably more thirsty then normal and my vision isnt right. When I had the passing out episode in june, they told me to drink equal amounts of gatorade and water and eating proteins every 3 hours.  She has spells where she's really active and spells where she isn't. I think I am going to l&d tmw morning when I get off for piece of mind."
            },
            {
              "RESPONSE_DATE": "2014-08-20T18:04:39-05:00"
            },
            {
              "RESPONSE_ID": "10962220"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "jjones2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7778528"
            },
            {
              "RESPONSE_BODY": "And sometimes my urine has an odor to it. Sorry that might tmi."
            },
            {
              "RESPONSE_DATE": "2014-08-20T18:05:19-05:00"
            },
            {
              "RESPONSE_ID": "10962223"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "dominika1980"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10006638"
            },
            {
              "RESPONSE_BODY": "Btw. I was keeping to a strict diet for a week but ended up loosing a whole kilo. This is very dangerous in pregnancy. \nAny amount of any healthy carb would throw my blood sugar out. \nHaving treatment doesn't always mean your will is weak. In my previous pregnancy this mega sensitivity to carbs wasn't discovered so i was made to feel terrible about myself despite trying so bloody hard.\n\nHang in there! At the end of the day, it's only a few months and it will go away :) that 1st piece of choc mud cake after birth tastes sooooo good ;)\n\nWhen you are struggling just remember you're doing this for you and for baby!!!!! Xoxo"
            },
            {
              "RESPONSE_DATE": "2014-08-20T19:49:41-05:00"
            },
            {
              "RESPONSE_ID": "10962878"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}