{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-diabetes-test-results/show/2502905"
    },
    {
      "USER_NAME": "lorinewmum"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9346202"
    },
    {
      "POST_TITLE": "Gestational diabetes test results"
    },
    {
      "POST_BODY": "Just got back my GTT results and was found to have an abnormal result. At fasting, my levels were 5.0 and after 2hrs it was 8.2 (normal level is 7.8). I've now been referred to the diabetes team for educational classes. Just wondering whether these readings are valid considering everyone responds differently to sugary drinks? I don't ever drink lucozade, nor so much sugary drinks so just a bit confused. I follow a relatively healthy diet and these results are just a bit upsetting. \n\nIn most situations, we don't ingest so much glucose at one time, do we? Does anyone understand the logic behind this test?\n\nAlso, lucozade isn't really a medical product, is it? I mean, its a manufactured product containing the following:\n\"Carbonated Water, Glucose Syrup (25%), Citric Acid (E330), Lactic Acid (E270), Flavouring (unspecified), Preservatives (Potassium Sorbate, Sodium Bisulphite (E-222)), Caffeine, Antioxidant (Ascorbic Acid), Colour (Sunset Yellow (E110), Ponceau 4R). A warning is printed on packaging that the colourings may have an adverse effect on activity and attention in children.\" \nSo I'm highly suspicious about the effects of this drink on blood sugar levels.\n\nMy question is, those who got an abnormal reading, with dietary changes, did you have a reverse in the results and was your baby affected? Is the result I got worth having sleepless nights over?"
    },
    {
      "POST_DATE": "2015-03-14T13:55:59-05:00"
    },
    {
      "POST_ID": "2502905"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\n\nThe test is a standardized test.  And it is believed to give good results.  Ie. if it shows an 'abnormal' result, there usually really is an abnormality.\n\nyour fasting level of 5 (90) and 2 hour number of 7.8 (147.6) are on the high side.  However, not terribly high.  This would mean that you have a good chance of being able to manage this with diet.\n\nIt is very important to control blood sugars during pregnancy for the benefit of the baby.  the insulin resistance (from the placenta) increases as the pregnancy progresses and thus blood sugars also tend to rise.\n\nHow far along in your pregnancy are you?\n\nYou should be given / get a blood sugar meter.  Your target fasting numbers should be < 5.2 (95), but ideally 4.4 - 5.0).  Your target 2 hour post eating should be < 6.6 (120) and never over 7.7 (140).  If it lower (ie 4.4 - 5.0 range), this is ok.\n\nShould you be losing sleep over this?  No.  But it is time for action.\n\nThe best diet will be one that limits carbs and sweets, is high in vegetables and unprocessed foods, including healthy fats.  The best diet for people with diabetes (including in pregnancy - your baby doesn't know what you eat, but it is affected by your blood sugar levels), is low carb, moderate protein (in pregnancy 1.5 - 2 g of protein / kg body weight), and high healthy (Unprocessed, naturally occurring fats - dairy, nuts, from meats, avocado) fats.\n\nPlease also make sure you exercise.  for example 30 minutes of walking / stationary bike, or other moderate exercise after eating, will greatly help in blood sugar control (or at least 30 - 60 minutes in the am / pm each day).\n\nI have had 2 diabetic pregnancies.  I used insulin as well as diet and exercise to manage my diabetes and my babies were very healthy and unaffected.  Took hard work and some discipline, but well worth the effort.\n\nYou can also download diet and sugar monitoring applications on this site.  \"My diet diary\" and \"Sugar sense\", which are very useful tools in monitoring blood sugar and also food consumption / carbs/ fat/ protein.\n\nHope this helps."
            },
            {
              "RESPONSE_DATE": "2015-03-15T19:59:38-05:00"
            },
            {
              "RESPONSE_ID": "12181204"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}