{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-Diabetes/show/1874029"
    },
    {
      "USER_NAME": "jenn873"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/4636892"
    },
    {
      "POST_TITLE": "Gestational Diabetes"
    },
    {
      "POST_BODY": "I am 32 weks pregnant and have just been diagnosed as having gestational diabetes. I am having a difficult time understanding why I have this. I am 29 years old, this is my 3rd pregnancy and I did not develop this condition with the first 2 pregnancies. I was, however in my early twenties with the first 2. Before pregnancy I was at a very healthy weight at 135 and I am 5' 7\" and I worked out 3-4 times a week. Since becoming pregnant I am only at the gym 1-2 times a week. I have gained almost 40 pounds with this pregnancy and still have 8 weeks to go.  I don't know why i.have gained so much this time around. Anyways, I can't help but feel I have done something to put myself and my baby at risk for future health problems. I have done a lot of research regarding the condition but am interested to hear other thoughts, opinions, and experiences. Thanks!"
    },
    {
      "POST_DATE": "2013-01-05T19:34:36-06:00"
    },
    {
      "POST_ID": "1874029"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "thirdtimemum"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/3605625"
            },
            {
              "RESPONSE_BODY": "I too am on my third pregnancy and i got GD with my first two. I find out in the next week or so if i have it again, but i'd say with my previous history no doubt i will. I am only a small person too, 95 lbs and i kept fit with my last pregnancy, even the doctors were baffled as to why i got it. you are usually a higher risk for it if you are overweight, already suffer diabetes, or are over 35. I've even been tested for it after pregnancy to see if i was suffering from it already. I'd like to know too why i got it when i didn't even have any risk factors! But don't stress yourself about it, i highly doubt its something you've done."
            },
            {
              "RESPONSE_DATE": "2013-01-05T21:42:08-06:00"
            },
            {
              "RESPONSE_ID": "8698012"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "thirdtimemum"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/3605625"
            },
            {
              "RESPONSE_BODY": "P.s. I have gained alot more with this pregnancy too, gaining about 1kg a week, and i have 14 more to go!"
            },
            {
              "RESPONSE_DATE": "2013-01-05T21:43:42-06:00"
            },
            {
              "RESPONSE_ID": "8698019"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "nichole75315"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/3145189"
            },
            {
              "RESPONSE_BODY": "I'm in your spot as well.  A little frustrated.  31w + 3 days....  27 years old as of 2 days ago.. and on my birthday was told I have to do the 3 hour fast test because my result was a 170 when the maximum is 50-70 or something =\\.  Monday I do the 3 hour fast.  My first 3 pregnancies also didn't have this.  Also slowed down on the gym.  However, I've only gained 14 lbs and recently lost 2 of those making it 12lbs.  I am sick that I've done something wrong.  I didn't cater to cravings this time -- mostly eating health foods and occasionally dipping into something a little wild.  My doctor told me if I refuse the test or do get a postive back it will mean counseling for it... and I will be educated on what I can and can not eat.  I kept asking, \"What if I simply refuse to hear this crap?\"  and they made it clear that was not an option.  I don't know. I'm irritated beyond belief.  I have a little over 8 weeks to go and your going to give me this kind of news?!!??"
            },
            {
              "RESPONSE_DATE": "2013-01-06T01:31:18-06:00"
            },
            {
              "RESPONSE_ID": "8698659"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "louieforlaughs"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/583196"
            },
            {
              "RESPONSE_BODY": "hello ladies,\rmy heart goes out to you and your grief. i want to tell you its not your fault, you have done nothing wrong. please do not get upset or beat yourself up about it, or your doctors. ; )\rits not completely lack of exercise or having a treat now and then. its your pancreas and how your body works. \rthey suspected i had gd with my first and now with my second there isn't a hint of it. (i have family with diabetes and i am over weight) \rmy aunt had gd with her first but never with her other two children. her son was born very big but she herself was always thin and does not have diabetes later on in life. sometimes its just the way your body works at that point in your life.\ri realize a good wallow is helpful sometimes but after you're done being upset i hope you can find a way to come to peace with gd and deal with it.\rthe counselling is just teaching you how to eat to maintain a steady blood sugar level so you don't get dizzy or have problems for your last few weeks of pregnancy. its only a few weeks of diet change and then you'll be back to normal. its not something that is worth being angry about but just doing for the health of you and your child. you may actually find that the diet makes you eat MORE!! i remember wanting to stop eating so much!! you eat every 2 or so hours and you get so tired of eating! you can also still have treats. i made it so that i would get 2 pieces of chocolate for a snack (especially cause i was tired of eating and 2 pieces of chocolate was like a break)  another benefit was my heart burn issue nearly went away completely!\ranyway, please don't blame yourselves or anyone, but just face the challenge as an adventure and a time to learn about what diabetics go through every day. see it as a learning experience and as a way of you taking care of the health of your little one.\rits really not so bad and not worth being upset over when you just have to change your diet a little bit.\rfood journals now will help you step into the diet easier when you do get the diet plan.\rgood luck ladies"
            },
            {
              "RESPONSE_DATE": "2013-01-06T10:35:34-06:00"
            },
            {
              "RESPONSE_ID": "8699667"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}