{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Meal-Plans/show/2596067"
    },
    {
      "USER_NAME": "LaciPark"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13821446"
    },
    {
      "POST_TITLE": "Meal Plans"
    },
    {
      "POST_BODY": "I'm 30 weeks along with my first baby, and I just found out that I have gestational diabetes. I thought I was doing really well from the moment I found out I was pregnant until today, but the dietician told me that I'm not 'balancing' my carbs correctly. \n\nDo any of you have any meal plans for breakfast lunch and dinner that have been great for you, as well as your family? I have my husband and 4 year old step son at home and really don't want to make them eat things that I know they don't like."
    },
    {
      "POST_DATE": "2015-05-14T11:48:05-05:00"
    },
    {
      "POST_ID": "2596067"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi.\nIf you are diabetic and trying to manage it by controlling your diet, you are going to need to monitor your carbs (how much), and see the impact on your blood sugar - using the blood sugar meter, to make sure you are at or below your targets.\n\nSome dieticians will recommend a huge amount of carbs.  When I was first diagnosed with diabetes in pregnancy, the dietician told me I should be eating about 250 g of carbs per day, split between 3 meals and 2 snacks.\n\nEven though I was using insulin I very quickly found that I could not control my blood sugar on that amount of carbs.  it ended up that I ate less than 100 g of carbs / day (but plenty of protein and healthy fats for calories).  In my case my carbs came mainly from vegetables (they are also highly nutritious). \n\nMost important for your baby is controlling your blood sugar.  Get a meter and use it to monitor how you are going and also to work out what (and how much) you can and cannot eat.\n\nEggs ended up being my stable for breakfast.  LUnch and dinner were both meat and veges.  I tried very hard not to snack, but if I did, it was things like nuts and cheese.\n\nHope this helps."
            },
            {
              "RESPONSE_DATE": "2015-05-15T01:15:17-05:00"
            },
            {
              "RESPONSE_ID": "12626759"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}