{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Failed-first-GD-test/show/2911508"
    },
    {
      "USER_NAME": "Sjameson"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18967444"
    },
    {
      "POST_TITLE": "Failed first GD test"
    },
    {
      "POST_BODY": "Hi- I am 28 weeks pregnant and just failed my 1 hour test yesterday with a 144. Doctors cut off is 140, so I have to take the 3 hour test. I won't be able to take it for 2 weeks as I will be on vacation, but I want to make sure that I am eating accordingly just in case I have it. Has anyone else had this long of a break between tests? And has anyone passed their 3hr? I'm debating buying the glucose test strips to use for the next couple of weeks to self monitor just in case but don't know if I'm being overly paranoid given the high false positive rate for the 1hr GD tests."
    },
    {
      "POST_DATE": "2016-08-05T10:19:43-05:00"
    },
    {
      "POST_ID": "2911508"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "ReggieLL"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/18929579"
            },
            {
              "RESPONSE_BODY": "I failed my 1 HR test (170) at 26 weeks and went back 1 week later for the 3 hour. I was super concerned (type 1 diabetes runs in my family) after I failed the 1hr, so I went to CVS and bought their brand glucometer because I didn't know how much I should invest in a meter and strips on the chance it was a false positive. It's not as accurate as the name brands (can be 2-5 points off and gives REALLY high readings if you don't fill the strip all the way) but it was a comfort for me to know my general blood sugar range (name brand test strips are HUNDREDS of dollars but can be covered by insurance after the 3gr test and a script from your dr). I ate like normal for the first day, testing as soon as I woke up and then 1hr after each meal. I was normal (78) when I woke up, but shot to 133 after breakfast of Greek yogurt and berries (I blame coffee creamer). I stayed in the 120s all day, which is considered too high. So, the next day I cut all carbs and sugar (no rice, pasta, beans, lentils, fruit [except berries], corn, potatoes, bread, peas, or condiments [other than mustard, balsamic vinegar, and mayo]).  My numbers lowered dramatically and I've been in the 80s and 90s since (I started testing 3 weeks ago). I ended up failing my 3hr test, and have my first Drs appointment with a specialist on Tuesday. I'm not sure if this helps you, but I do recommend buying the store brand meter and testing. See which foods make your blood sugar go up, and then avoid them. I also had my husband eat and test with me so I knew how much higher I was than \"normal\" readings. We went to Chipotle and got the same exact thing (burrito bowl with chicken) and an hour later he was at 100 and I was 117. 2 hours later he was 86 and I was 119. Anyway, that's my advice & experience. Good luck!!!!!"
            },
            {
              "RESPONSE_DATE": "2016-08-05T18:41:48-05:00"
            },
            {
              "RESPONSE_ID": "13963826"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}