{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Failed-1-hour-glucose-tet-by-30-points-any-suggestions/show/2699848"
    },
    {
      "USER_NAME": "reem2015"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12240700"
    },
    {
      "POST_TITLE": "Failed 1 hour glucose tet by 30 points.. any suggestions?"
    },
    {
      "POST_BODY": "I failed my one hour glucose test. The cutoff was 140 and my number came back as 170. \n\nI do not like or eat anything that is sweet. :( my only weakness is rice but that too i had limited the intake. I lost 1.5 lbs between 24 to 28 weeks. And diabetes does not run in our family at all. Still the numbers came back so high. I have my 3 hrs test scheduled on wednesday. Not that m freaking out but just a little disheartened. I honeslty thought i would pass this 1 hr test. Not sure what i ate/did wrong.\n\nAny experience sharing or suggestions would ve very very helpful to ease my mind."
    },
    {
      "POST_DATE": "2015-08-03T10:49:20-05:00"
    },
    {
      "POST_ID": "2699848"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "NewatThis7980"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14590199"
            },
            {
              "RESPONSE_BODY": "I asked my Dr if my dramatic increase of cake consumption could effect glucose test and she said \"not likely\". It's more family history, your history, blood levels, etc.\n\nSo don't beat yourself up, nothing you could have done."
            },
            {
              "RESPONSE_DATE": "2015-08-03T12:15:39-05:00"
            },
            {
              "RESPONSE_ID": "13060939"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "babybolen"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12513077"
            },
            {
              "RESPONSE_BODY": "I failed the 1 hour test and went back for the 3 hour and passed it. I wouldn't stress over it. I was really concerned I wasn't going to pass it the second time but all is well :) good luck!"
            },
            {
              "RESPONSE_DATE": "2015-08-03T13:06:53-05:00"
            },
            {
              "RESPONSE_ID": "13061227"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "maw4389"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12070699"
            },
            {
              "RESPONSE_BODY": "Unfortunately gestational diabetes doesn't have to run in your family for you to get it. It has never ran in my family and I came very close to failing the 1 hour test. It can happen to anyone."
            },
            {
              "RESPONSE_DATE": "2015-08-03T13:10:32-05:00"
            },
            {
              "RESPONSE_ID": "13061246"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "azndoraemon"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7833149"
            },
            {
              "RESPONSE_BODY": "I'm asian and i eat rice almost everyday but i passed the test.  I don't think it has to do with eating rice.  Could it be your husband?"
            },
            {
              "RESPONSE_DATE": "2015-08-03T16:47:03-05:00"
            },
            {
              "RESPONSE_ID": "13062176"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "reem2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12240700"
            },
            {
              "RESPONSE_BODY": "Thank you for the replies ladies. I feel so better reading them. All this while i kept wondering what did i do wrong. doubt if i would pass the 3 hrs test. But will accept whatever happens and do my best! Thats all i can control. :)\n\n@azndoraemon: i am not sure. But you could have a point. My husband's family does have a history of high blood sugar!! I will defintely ask my doc during the next visit if that could make a difference. Also i have heard from a doctor friend of mine that stress can produce hormones which increase the blood sugar level. I was indeed very very stressed the last 2 weeks(thanks to my MIL!!). So that could be the reason too. Ugghh!!"
            },
            {
              "RESPONSE_DATE": "2015-08-04T08:10:26-05:00"
            },
            {
              "RESPONSE_ID": "13065010"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "CecilyTy"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/15139957"
            },
            {
              "RESPONSE_BODY": "I failed my 1 hour test with 178 :/ I thought for sure I would fail my 3 hour with that number, but I passed it with numbers well below what the standards were. Don't stress. A lot of women fail the 1 hr and easily pass the 3 hr. :)"
            },
            {
              "RESPONSE_DATE": "2015-08-04T08:53:25-05:00"
            },
            {
              "RESPONSE_ID": "13065148"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "azndoraemon"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7833149"
            },
            {
              "RESPONSE_BODY": "I'm sorry that your MIL is stressing you out but try to work through the problems with her or find a better way to control your stress.  \n\nI rarely eat sweet stuff so when i had to drink the bottle of sugar - i was so dizzy and nausea the whole two hours when i was in the lab.  I didn't think sugar could kill me like that.  \n\nDon't stress about this test because diabetic can develop over time when the baby grows up."
            },
            {
              "RESPONSE_DATE": "2015-08-12T05:02:54-05:00"
            },
            {
              "RESPONSE_ID": "13102854"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Krissy066"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11516830"
            },
            {
              "RESPONSE_BODY": "I failed both tests by a lot, but I was diet controlled through my pregnancy. The good thing is you will get a lot more special care/more ultrasounds if you do end up having GD, I just gave birth to my lo 2 weeks ago and she is perfect. I dont have diabetes in my family, however my husband does have it, not sure there is a connection? But anyway of only failing by 30 points I'm sure you will pass your next one. Did you eat before going in? Mine was fasting."
            },
            {
              "RESPONSE_DATE": "2015-08-12T05:59:20-05:00"
            },
            {
              "RESPONSE_ID": "13102975"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "mags242001"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12981378"
            },
            {
              "RESPONSE_BODY": "The glucose test measures ur diabetes not the baby's.. therefore it's not based on the father's family history. It is ur diet. Or diet b4 ur pregnancy. There r many foods that some ppl think it's healthy (like some fruit) when it's very hight in sugar. N juice soda Aldo contribute. But in order to know we would have to examine what u eat on a regular bases for a while. N ur fat percentage n body type. If it's not that it's just pregnancy developed diabetes.. it might go away but it does mean that ur more likely to develop it later on in life. So definitely u have to look into what ur diet consist of if u want to avoid it later."
            },
            {
              "RESPONSE_DATE": "2015-08-12T06:22:42-05:00"
            },
            {
              "RESPONSE_ID": "13103037"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "reem2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12240700"
            },
            {
              "RESPONSE_BODY": "Thank you for replying mommies! I failed my 3 hrs test by a few points so have to meet a diabetic counsellor this week. Initially was a little upset since i was not expecting this result going by my family history and my food habbits. But now i feel its better that i will be closely monitored and get all the special care rather than doing something wrong and going undetected! Anything thats good for my baby, i wouldnt mind doing. :)\n\nAnother positive outcome from my GD diagnosis is that i have completely started ignorning my MIL and her tantrums, have learnt to say a \"NO\" and set the limits without hesitating. All i really care is about my baby! Just want theae remaining 10 weeks to pass away soooon! :)"
            },
            {
              "RESPONSE_DATE": "2015-08-12T08:51:15-05:00"
            },
            {
              "RESPONSE_ID": "13103553"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "CourtBeck"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13065041"
            },
            {
              "RESPONSE_BODY": "Go for my 1 hour test in September, I'm already nervous about it."
            },
            {
              "RESPONSE_DATE": "2015-08-13T05:10:38-05:00"
            },
            {
              "RESPONSE_ID": "13107964"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}