{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-Diabetes-help/show/2681189"
    },
    {
      "USER_NAME": "prussell1987"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13015463"
    },
    {
      "POST_TITLE": "gestational Diabetes help"
    },
    {
      "POST_BODY": "Has anyone else failed the 1 hr test and told that you are considered automatic Diabetic?  Asked specialist about 3 hr test and they said you were 224, no second test. We cancel someone else to have you come in monday, you can't miss appointment.  Oh and you will be here for 4 to 5 hrs, and take a more in depth ultrasound.  Here's the diet you have to be on till you come in... milk 4 Oz or less per day, carbs equivalent to half cup rice per day, no fruits no juice. Got it good see you Monday. .."
    },
    {
      "POST_DATE": "2015-07-18T08:58:38-05:00"
    },
    {
      "POST_ID": "2681189"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Tsipler"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/14548857"
            },
            {
              "RESPONSE_BODY": "I think because your number is so high they are saying it is automatic...the diet thing is ridiculous! They should have you meet with the dietician to learn how to count carbs and how to spread them out throughout the day. I didn't like my dietician because she kept trying to force a strict diet on me which ended up making my sugars really low. My advice is to try to get a variety of food throughout the day... My carb numbers are 15g - 30g breakfast (it is hard for your body to deal with carbs in the morning so you may want to go lower until you know how much you can take) 30g - 40g for both lunch and dinner... Eat lots of proteins they will keep you fuller for longer and lots of low carb veggies (broccoli, spinach, stuff like that avoid corn it is high in carbs) \n\nHonestly, if she is dictating your whole diet I would question it!!! Eat what you like but make sure the portions are correct and if you eat a little more than you're supposed to do some exercise! \n\nGD is a change but it isn't too bad...really portion control and exercise is key to dealing with it! Hope that helps, good luck! And if your dietician/dr are being too hard with the diet and guidelines tell them to be more helpful rather than demanding!"
            },
            {
              "RESPONSE_DATE": "2015-07-18T09:18:43-05:00"
            },
            {
              "RESPONSE_ID": "12980654"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "cliqueguy1992"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11715504"
            },
            {
              "RESPONSE_BODY": "Yes I have it. Like the above poster it's all about portion control and carb watching. It was hard in the beginning but I got the hang of it. Usually after every meal I go for a 30 min walk it def helps to bring the numbers down. Did they put you on insulin? It usually goes away after you give birth hopefully but exercising def helps just don't do too much."
            },
            {
              "RESPONSE_DATE": "2015-07-18T09:31:57-05:00"
            },
            {
              "RESPONSE_ID": "12980698"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "momofsoon2b5"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12364159"
            },
            {
              "RESPONSE_BODY": "I failed the first one and was schedule for the second one 3-4 hour one and I passed"
            },
            {
              "RESPONSE_DATE": "2015-07-18T09:37:47-05:00"
            },
            {
              "RESPONSE_ID": "12980717"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "moejoe8041"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12670015"
            },
            {
              "RESPONSE_BODY": "Hopefully you wont have to b on insulin like me but in the beginning my doctor put me on that diet until i could meet with the dietician. Its still very similar to that diet just incorporated the carb counting with it. I recently was just allowed to add fruit n my meal bc fruit can b very very tricky especially if you are on insulin. Good luck its not as hard as it seems once you get it. Ive notice splitting up my meals works better for me and 2 hours later if in still hungry eat the other half"
            },
            {
              "RESPONSE_DATE": "2015-07-18T11:12:44-05:00"
            },
            {
              "RESPONSE_ID": "12981110"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "prussell1987"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13015463"
            },
            {
              "RESPONSE_BODY": "Thank you for the advice."
            },
            {
              "RESPONSE_DATE": "2015-07-18T11:43:52-05:00"
            },
            {
              "RESPONSE_ID": "12981235"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\n\nwith 224 at the 1 hour test, there is a good chance that you will be put on insulin.  This is because as your pregnancy progresses insulin resistance increases.\n\nHowever, I would like to reassure you that insulin is actually a good thing.  With insulin you can much more easily control blood sugar.\n\nI have already had 2 pregnancies using insulin, and am possibly about to have a 3rd (in the TWW and suspecting)....  It is doable.  And certainly worth it for a healthy baby."
            },
            {
              "RESPONSE_DATE": "2015-07-19T01:27:58-05:00"
            },
            {
              "RESPONSE_ID": "12984218"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}