{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Gestational-Diabetes-Day-1--Help/show/2967994"
    },
    {
      "USER_NAME": "Sutie247"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20105057"
    },
    {
      "POST_TITLE": "Gestational Diabetes Day 1 :( Help"
    },
    {
      "POST_BODY": "I just found out I have gestational diabetes. My docs nurse said they'd call me regarding a class but said I need to start testing 4 times a day. She didn't really give me insight as to when. I'm assuming after meals. But how long do I wait after I eat to test? One hour or 2? And when should start counting the hour from? The start of when I eat or after I finish eating?"
    },
    {
      "POST_DATE": "2017-03-23T10:20:50-05:00"
    },
    {
      "POST_ID": "2967994"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "amy4322"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20110073"
            },
            {
              "RESPONSE_BODY": "You should test the following times: 1. Fasting when you wake up, 2. After breakfast 2hr 3. After 2hrs of lunch, 4 After 2hrs of dinner. Make a chart and if you are taking any medication, write down the dosage as well. I would suggest that you write down what did you eat at every meal so it will gives you insight into what type of food could be good or bad for you."
            },
            {
              "RESPONSE_DATE": "2017-03-24T05:43:02-05:00"
            },
            {
              "RESPONSE_ID": "14150496"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi, the timing mentioned by the previous poster is correct. \nYou may find that reducing how much carbs you eat will help to keep your levels in check.  Focus on getting plenty of vegetables (but avoiding sugars, and minimizing grains, fruits etc).  If you do need to end up taking insulin, this is also ok.  It is a very effective tool and it is not as bad as it may seem at first sound. \n\nPlease ask us if there is anything we can help you with."
            },
            {
              "RESPONSE_DATE": "2017-03-25T01:56:21-05:00"
            },
            {
              "RESPONSE_ID": "14151174"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "LCDay"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20197149"
            },
            {
              "RESPONSE_BODY": "I'm newly diagnosed for gestational diabetes and was told similar to what was previously posted. Additionally, I was told to have a snack when I test 2hrs after a meal to keep things steady."
            },
            {
              "RESPONSE_DATE": "2017-04-15T00:00:00-05:00"
            },
            {
              "RESPONSE_ID": "14165128"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "VickyRhodes"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20196084"
            },
            {
              "RESPONSE_BODY": "This is the second time I've been diagnosed with gestational diabetes. Once with my oldest, didn't get it with my youngest and now I have it. I have to test 4x's/day, 1 hour after meals. One fasting in the morning, and then after I eat throughout the day."
            },
            {
              "RESPONSE_DATE": "2017-04-20T23:53:16-05:00"
            },
            {
              "RESPONSE_ID": "14169009"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}