{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes-/show/2371253"
    },
    {
      "USER_NAME": "AshleyKeene"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8896161"
    },
    {
      "POST_TITLE": "gestational diabetes?"
    },
    {
      "POST_BODY": "My score was 129 and the nurse partictionar said that as long as its 129 or below I'm fine. I think I do have it though after my u/s the lady who saw my baby said she weighed ,6 pounds at 34+5 weeks then her heartbeat was 175 and she kept asking if I was positive I didn't have it. Nobody has ever had gestational diabetes in my family but I'm convinced I might and the test could be wrong. I was at my aunts and I kept drinking a lot of water prob went threw 2 jugs within a 2 or 3 hour time period and she also asked me if I had that I guess that's one of the signs if I do does that mean me and my baby have diabetes now? What is gestational diabetes and what does it do to me and my baby? Does anyone else have it?? Or expieranced this.. worried I'm a ftm"
    },
    {
      "POST_DATE": "2014-11-09T04:01:40-06:00"
    },
    {
      "POST_ID": "2371253"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "AshleyKeene"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8896161"
            },
            {
              "RESPONSE_BODY": "Please some one"
            },
            {
              "RESPONSE_DATE": "2014-11-09T06:56:40-06:00"
            },
            {
              "RESPONSE_ID": "11492777"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "alid32"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9440890"
            },
            {
              "RESPONSE_BODY": "Gestational diabetes is a form of diabetes that comes on during a woman's pregnancy. You don't even need to have a family history of it. You can have it in one pregnancy and not another, although it's more common in subsequent pregnancies once you have had it. It goes away after pregnancy. What happens is your body slows down metabolism during pregnancy to ensure that your growing baby gets enough nutrients. This causes your pancreas to produce more insulin to keep your blood sugar levels within a normal range. With gestational diabetes, your body doesn't produce the extra  insulin causing your blood sugar levels to rise. Left uncontrolled this can result in too much weight for you and baby. It can also lead to preterm birth and initial problems regulating the baby's blood sugar after birth as they are used to high amounts of sugar in their body. It can also cause them to b larger, increasing the risk of c section (they consider large over 9 pounds). It doesn't mean that they baby will have diabetes though. Diabetes can be controlled with diet and moderate exercise, as well as medication if needed. I can't imagine that you doc wold say that you were okay if you weren't though, as that could be dangerous. You could be like me, and be glucose intolerant. I don't have GD, but I don't completely process the glucose like I should. So I watch my carbs and sweets intake. Increase vegetables and lean protein. That manages it fine. I would say if you're super nervous talk about your concerns with your doctor again. Good luck"
            },
            {
              "RESPONSE_DATE": "2014-11-09T07:10:00-06:00"
            },
            {
              "RESPONSE_ID": "11492811"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}