{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/diabetes-and-labour/show/2670242"
    },
    {
      "USER_NAME": "Roobsx"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9335067"
    },
    {
      "POST_TITLE": "diabetes and labour"
    },
    {
      "POST_BODY": "Hi everyone. I'm 33+3 at 28 weeks I was told I had gestational diabetes. I went to the midwife yesterday and when she measured me I was measuring around 36 weeks. I've been told if my baby is bigger they'll take him out early either by inducing me or a c section. Just wondering if anyone has been through this before? I don't see the obstetrician for a few more weeks to discuss and don't wanna get there and only have a week to prepare myself if its what's gotta happen x"
    },
    {
      "POST_DATE": "2015-07-10T09:30:30-05:00"
    },
    {
      "POST_ID": "2670242"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "annlouannee"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13800522"
            },
            {
              "RESPONSE_BODY": "I have pre-existing diabetes, and my last baby came unexpectedly. I went for a regular checkup and her heartbeat was dipping too fast and too often, so they induced that day. I was totally blindsided and unprepared. So my advice would be to be ready for the unexpected. You could possibly have your baby early. Hopefully all goes well and your sugar will stay in control and lead to a healthy, full term baby."
            },
            {
              "RESPONSE_DATE": "2015-07-10T18:07:44-05:00"
            },
            {
              "RESPONSE_ID": "12942389"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Roobsx"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9335067"
            },
            {
              "RESPONSE_BODY": "Yeah I think I might take everything with me in the car just in case I've heard so many stories about people going for their check up and coming home with a baby because they've been induced haha"
            },
            {
              "RESPONSE_DATE": "2015-07-11T10:12:59-05:00"
            },
            {
              "RESPONSE_ID": "12945067"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}