{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/High-fasting-blood-sugar/show/2929760"
    },
    {
      "USER_NAME": "uhooreo82"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19329099"
    },
    {
      "POST_TITLE": "High fasting blood sugar"
    },
    {
      "POST_BODY": "I am recently diagnosed with gestational diabetes. My fasting glucose usually sit at right around 100 on a daily basis.\nMy 2 HR pp levels are terrific (as my dr stated) I am trying to avoid taking any medications for the diabetes. Is there anything I can do to bring my fasting sugars down??"
    },
    {
      "POST_DATE": "2016-10-10T18:30:39-05:00"
    },
    {
      "POST_ID": "2929760"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Aparnagoutham"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19416320"
            },
            {
              "RESPONSE_BODY": "Eat early dinner and walk before you take your fasting sugar"
            },
            {
              "RESPONSE_DATE": "2016-10-25T16:03:32-05:00"
            },
            {
              "RESPONSE_ID": "14039398"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "Exercise will help.  You could also try having a small snack before bed (this should be protien and fats - ie. egg with mayonaise, some cheese and nuts, etc).  By eating at night you may be able to help your morning blood sugar be a bit lower.  When you have extended fasting your liver can put out glucose.  By eating a small snack you may be able to prevent your liver doing this.  hope this helps.  Please come back and let us know how you're going. \n\nOften diabetes in preganncy will get worse as the pregnancy progresses (insulin resistance increases as the pregnancy progresses and the placenta grows).  I am telling you this so that you know that even if you can't get the blood sugar as low as you want it is not a failure on your behalf.  Usually insulin is used during pregnancy.  If it does come to this, it is nothing to be feared, it is just an effective tool to be sure you and your baby are healthy."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14049396"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}