{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/induce/show/2447167"
    },
    {
      "USER_NAME": "L23romero"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11721727"
    },
    {
      "POST_TITLE": "induce"
    },
    {
      "POST_BODY": "I am really nervous I have seven weeks to go they'll induced me at 37 weeks because gestational diabetes and high blood pressure.. I really don't know what to expect"
    },
    {
      "POST_DATE": "2015-01-26T11:16:16-06:00"
    },
    {
      "POST_ID": "2447167"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "TDeniseRN"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11942091"
            },
            {
              "RESPONSE_BODY": "I was induced at 37 weeks with my first son due to dilating to a 2 early on. I was nervous, but was in the care of an amazing doctor. Try not to stress too much. The nurses and staff there should be happy to answer any questions you may have in the process."
            },
            {
              "RESPONSE_DATE": "2015-01-26T11:23:04-06:00"
            },
            {
              "RESPONSE_ID": "11898232"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "ultimas2314"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11707673"
            },
            {
              "RESPONSE_BODY": "I got induced  but I was a week past due i was scared at first but it was OK its almost like to ng into labor it slowly happens over time and the after awhile u can have the epidural if u want just relax and everything will be ok goodluck to you"
            },
            {
              "RESPONSE_DATE": "2015-01-26T12:06:57-06:00"
            },
            {
              "RESPONSE_ID": "11898465"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "wiggles2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10437721"
            },
            {
              "RESPONSE_BODY": "In 32 weeks. In a just a few days and my glucose was a little high and I have to go to the hospital tomorrow to check if I have gestational diabetes. My blood pressure has been a little high. And my doc says she doesn't think I have it. But she said because of being a little over weight and having a little high blood pressure. If I don't go into labor and don't have my daughter by 37 weeks without having to be induced that by my 38th week she will induce me. I'm kind of excited because I wanna meet my daughter but I'm also scared. I'm scared that because your due date is just an estimation what if that estimation is wrong and in sad ready of being 38 weeks I was actually 34 weeks. I just don't wanna see my daughter have to go to the nicu. But I know if it does happen we have good docs that will take good care of her. I'm also scared because they say being induced makes labor harder and hurt way more. That it's gonna put me into stress and stress out my daughter where they will have to do a c section.and it doesn't help that ive never had surgery before I'm I am afraid to be cut open. But I have family and friends that wI'll be here for me. And it also doesn't help when y husband says idk if I can be on the room while you're getting cut open. Idk if I can handle seeing them do that. And it's like okay what if it's really late and nobody answers there phones to come down. Or anything and I end up no having anybody there to keep me calm. I'm gonna feel like I'm alone and I'm going to flip out. And he goes okay if nobody is @ the hospital that you would like to be in there with you. Then I will go. But if I get to push and do it natural. I'm gonna have my best friend and my husband by my side holding my hands."
            },
            {
              "RESPONSE_DATE": "2015-01-26T12:22:56-06:00"
            },
            {
              "RESPONSE_ID": "11898526"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "wiggles2015"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10437721"
            },
            {
              "RESPONSE_BODY": "Oh and also I felt weird the other day so I went in and my doc checked to see if I am dilated I am already @ a 2"
            },
            {
              "RESPONSE_DATE": "2015-01-26T12:26:07-06:00"
            },
            {
              "RESPONSE_ID": "11898543"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "L23romero"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11721727"
            },
            {
              "RESPONSE_BODY": "Thank you girls.. Hopefully today everything goes well I will get monitor for the stress test today.."
            },
            {
              "RESPONSE_DATE": "2015-01-27T10:49:56-06:00"
            },
            {
              "RESPONSE_ID": "11903533"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "L23romero"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11721727"
            },
            {
              "RESPONSE_BODY": "Girl I am going thru the same I gained 42 pounds.. And now I have high blood pressure and gesitational diabetes.. Good luck"
            },
            {
              "RESPONSE_DATE": "2015-01-27T10:52:07-06:00"
            },
            {
              "RESPONSE_ID": "11903542"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Aviator34"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10548441"
            },
            {
              "RESPONSE_BODY": "I read your post. I'm also on my 2nd baby and had a previous c section. However I've read in the college of ons and gynaecology that if previous c section mothers haven't had their baby by 37wks then a repeat c section should be administered! Induction is out of the question due to the previous scarring and will prolong the labour please read the section about Vbac... There is a new guideline coming in 2015 and the concerns of midwives pushing for vbac. Hope this helps you"
            },
            {
              "RESPONSE_DATE": "2015-01-27T10:58:28-06:00"
            },
            {
              "RESPONSE_ID": "11903567"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "L23romero"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11721727"
            },
            {
              "RESPONSE_BODY": "Thank you aviator :)"
            },
            {
              "RESPONSE_DATE": "2015-01-27T13:15:30-06:00"
            },
            {
              "RESPONSE_ID": "11904163"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Tlo89"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9604972"
            },
            {
              "RESPONSE_BODY": "Trying for a second baby, I'm nervous i had a miscarriage in October after having my iud removed in July my progetrone  was very low when I got my blood drawn and ultrasound baby didn't attach, three months later after 3 cycles I'm prego again 4weeks now I had my blood drawn at 3weeks and my hcg levels were low cuz it's early but my progetrone was really good and high is it looking good that this baby is going to be ok please help"
            },
            {
              "RESPONSE_DATE": "2015-01-27T13:28:08-06:00"
            },
            {
              "RESPONSE_ID": "11904213"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}