{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/anyone-with-gestational-diabetes/show/2508698"
    },
    {
      "USER_NAME": "Mommy861"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/12694773"
    },
    {
      "POST_TITLE": "anyone with gestational diabetes??"
    },
    {
      "POST_BODY": "i am 37 weeks pregnant. I have gestational diabetes. I do not take meds and insulin because my sugar has always been in control throughout whole pregnancy but since ive started my ninth month it has been getting veryy difficult to control. I eat very less avoiding potatoes rice and all high cArb food. I was wondering does eating less would affect my bAbys weight? Does anyone have gestational diabetes ? How do you control it without effecting bAbys weight? My baby weighs 2.7 kilograms."
    },
    {
      "POST_DATE": "2015-03-19T21:12:28-05:00"
    },
    {
      "POST_ID": "2508698"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "jonesfamily15"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11978977"
            },
            {
              "RESPONSE_BODY": "I have it aswell and my dietician never recommends eating no carbs. Everything in moderation. Were you given a meal plan? I would just follow that. Sometimes Im not hungry when its my snack time but I have to remind myself that its nutrients the baby needs including carbs. One thing that helps keep my sugars under control is going for a 15 min walk after I eat. Goodluck were almost there :)"
            },
            {
              "RESPONSE_DATE": "2015-03-19T21:50:10-05:00"
            },
            {
              "RESPONSE_ID": "12205933"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "hol1127"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10746697"
            },
            {
              "RESPONSE_BODY": "I have it too and instantly turned to Google to help me understand more before meeting with the specialist.  I'll post the website in another comment. It explains how to add proteins with carbs to help break them down."
            },
            {
              "RESPONSE_DATE": "2015-03-21T22:27:50-05:00"
            },
            {
              "RESPONSE_ID": "12217324"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "hol1127"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10746697"
            },
            {
              "RESPONSE_BODY": "http://www.allinahealth.org/Health-Conditions-and-Treatments/Health-library/Patient-education/Gestational-Diabetes/Healthy-eating-physical-activity-stress-management/Basic-meal-planning/"
            },
            {
              "RESPONSE_DATE": "2015-03-21T22:28:02-05:00"
            },
            {
              "RESPONSE_ID": "12217325"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Very low carb is safe during pregnancy - as long as you are getting plenty of non-starchy vegetables, protein and healthy fats.   Your baby doesn't know whether you eat carbs or not, but what does affect it is high blood sugar.  There is no evidence that eating low carb is dangerous in pregnancy (but there is plenty of evidence that high blood sugar is dangerous to both mother and baby).  So you need to adopt a diet and activity level that will result in controlled blood sugar.\n\nIf you cannot control your blood sugar with diet / exercise, you need to be given insulin, which will surely be effective when used properly."
            },
            {
              "RESPONSE_DATE": "2015-03-22T20:21:18-05:00"
            },
            {
              "RESPONSE_ID": "12221750"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}