{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2338524"
    },
    {
      "USER_NAME": "howarth3"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8764701"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "Just been diagnosed with gestational diabetes and wondered if anyone had any experience with it?"
    },
    {
      "POST_DATE": "2014-10-09T15:08:39-05:00"
    },
    {
      "POST_ID": "2338524"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "tbjt77"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10798649"
            },
            {
              "RESPONSE_BODY": "Ive been a diabetic since I was 13. Its hard.. try to maintain. . Even after. What they fail to tell you is once your one... it stays. Good luck"
            },
            {
              "RESPONSE_DATE": "2014-10-09T16:29:27-05:00"
            },
            {
              "RESPONSE_ID": "11312646"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pogana13"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/8592656"
            },
            {
              "RESPONSE_BODY": "It's hard at first but it does get easier.  I cried a lot in the beginning."
            },
            {
              "RESPONSE_DATE": "2014-10-09T19:43:45-05:00"
            },
            {
              "RESPONSE_ID": "11313790"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "catacris"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10115868"
            },
            {
              "RESPONSE_BODY": "Gestational diabetes goes away as soon as you have the baby. I had it with my second child, no big deal, take care of yourself, eat right and WALK!! Everything will be alright, don't worry."
            },
            {
              "RESPONSE_DATE": "2014-10-09T20:09:15-05:00"
            },
            {
              "RESPONSE_ID": "11313912"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Rippy_Baby"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10645486"
            },
            {
              "RESPONSE_BODY": "I haven't had it during any of my pregnancies but my mom did with one of my sisters. It went away after that pregnancy."
            },
            {
              "RESPONSE_DATE": "2014-10-09T20:24:55-05:00"
            },
            {
              "RESPONSE_ID": "11313986"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Dandi_2014"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9971658"
            },
            {
              "RESPONSE_BODY": "I was diagnosed with Gestational Diabetes.\nThis is what I've been told.\n\nIt is genetic, not by any means your own fault.\nYour mother or grandmother or auntie may have had Gestational Diabetes during their pregnancy?\nThey might even not known they had it.\n\nIf you can control your bloodsugar levels with diet and light exercise, then excellent.\nIf not, you may need to start taking insulin.\nDon't be devestated if you have to start with insulin, your body stopped producing enough insulin and if you don't have enough -then it is just that.\nNot enough.\n\nI was living a health nut lifestyle and STILL failed some of my bloodsugar readings.\nIt was frustrating and devastating.\nNow I am on insulin and my readings are good, which is much better than growing a too large baby that may have high health risks if you do not control your bloodsugar.\n\nWhat happens when your body has too much sugar is that it sends too much sufar through to your baby.\nYour baby has insulin, but not nearly enough for these sugarlevels.. so your baby grows.\nAnd fast too!\nThis does NOT mean it develops faster, some development areas actually SLOWS down.\nLike the development of lungs and breathing.\nYour breastmilk may also come in later, around week 35, you should see a specialists for your breastmilk and she will examine you and show you how to massage them and to hopefully stimulate milk flow.\n\nThis is one thing your hospital should monitor closely for a few days before they release you two home again.\nThey will also test your babys bloodsugar levels and of course yours.\n\nYou have 1/3 chance that you'll STILL have diabetes after birth.\nIf you don't have it, you still have an increased chance of getting diabetes later in life.\nDiabetes is quite serious, so you should make sure to check it regulary even if you don't have it.\nAsk your doctor how often you should check yourself for diabetes after you've had your baby.\n..oh yes.\nIf you get pregnant again, you're very likely to have Gestational Diabetes again.\n\nGestational diabetes *****.\nI'm sorry, but it really does.\nIt makes your day revolve around it and it is frustrating having that additional THING when we are already going through so much.\n\nGood luck hun.\nI hope it goes well."
            },
            {
              "RESPONSE_DATE": "2014-10-09T20:57:50-05:00"
            },
            {
              "RESPONSE_ID": "11314197"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "krarline"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/10081453"
            },
            {
              "RESPONSE_BODY": "I found out i had it early(around 9/10w) but i think i had it before...i was soooo worried but my specialist was verrry reassuring-dnt let it stress u, it can be controlled& it can possibly go away but its a possibility tht youD still have it...It can b time consuming for a healthy baby its worth every second-Good luck, every thing is gonna b okay"
            },
            {
              "RESPONSE_DATE": "2014-10-10T05:43:30-05:00"
            },
            {
              "RESPONSE_ID": "11315869"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Mrs_English2"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9096031"
            },
            {
              "RESPONSE_BODY": "Okay gestational diabetes is not genetic. Just because an aunt or even your mom may have had it doesn't mean you get it. How ignorant. But if you have actual diabetes in your family you run a higher risk yes. Also if you are considered iver weight you are high risk. I have it currently. 29 wks along. Doc told me as long as i make sure my blood sugar stays under norm numbers. It will go away after birth. It also means baby will possibly be born with low blood sugar due to it. And ve fed sugar water to get sugars to norm levels. Your baby will be fine. But you should get sugars under control and let this be a lesson."
            },
            {
              "RESPONSE_DATE": "2014-10-10T11:31:44-05:00"
            },
            {
              "RESPONSE_ID": "11317262"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Dandi_2014"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9971658"
            },
            {
              "RESPONSE_BODY": "My doctor has told me it is genetic..\nIt is not a guarantee you get it if -for example, your mother had it.\nMany don't have it.. but it is genetic, that is what my doctor told me..\nSo if you have it, you've probably inherited it from a relative.\n\nI am healthy, young, and never been overweight in my life.\nHow is this a lesson?\nIt is not like we brought this on on our own?\n\nThere is still 1/3 that still have diabetes after delivery, there is no guarantee it goes away (I wish there was!).\nI just don't think we should sugarcoat it, hope for the best - yes absolutely! \nBut be prepaired for the worst.\n\nYou'll be tested, your baby will be tested.\nI hope you don't have it afterwards..\nBut you will have an increased risk of getting diabetes in your life (you may not as well), so just stay healthy and check with your doctor how often you should check yourself for diabetes.\n\nGood health to you all."
            },
            {
              "RESPONSE_DATE": "2014-10-10T11:56:05-05:00"
            },
            {
              "RESPONSE_ID": "11317392"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "alid32"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/9440890"
            },
            {
              "RESPONSE_BODY": "Mrs English-You don't need to be rude to people. I've been a nurse for several years and can tell you- Diabetes can be linked to genetics. For instance if you have a family member with it or they had gestational diabetes it does increase your risk. As does poor diet and obesity. Know all the facts before you feel the need to be insulting. We're all here to learn from each other. Not tear each other down."
            },
            {
              "RESPONSE_DATE": "2014-10-10T13:11:12-05:00"
            },
            {
              "RESPONSE_ID": "11317852"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}