{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Im-new-to-this-and-my-blood-levels-are-still-high-Help/show/2964544"
    },
    {
      "USER_NAME": "Natamo715"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20044487"
    },
    {
      "POST_TITLE": "I'm new to this and my blood levels are still high. Help!"
    },
    {
      "POST_BODY": "I was diagnosed on Saturday with GD. I have been strictly following the guidelines for carbs and exercise since then. I just received my blood sugar monitor yesterday. My numbers were okay yesterday, but today they are very high. I have been well within the range of carb/sugar intake the dietician recommended. I have also exercised faithfully each day. I followed the no fruit/dairy at breakfast and dinner snack recommendation, as well.  What else can I do to lower these numbers?"
    },
    {
      "POST_DATE": "2017-03-08T18:29:04-06:00"
    },
    {
      "POST_ID": "2964544"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "BeliReyes"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20016254"
            },
            {
              "RESPONSE_BODY": "I also have gestational diabetes and I have found that cutting out breads has helped. I also am following a low carb diet, meaning 20 g of carbs per meal and 15 g for snacks also increasing my protein has helped. I eat about 120 g of protein a day."
            },
            {
              "RESPONSE_DATE": "2017-03-10T10:53:54-06:00"
            },
            {
              "RESPONSE_ID": "14140898"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "legobin11"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19976499"
            },
            {
              "RESPONSE_BODY": "This is my 3rd pregnancy and I've had gd with all 3 now.  Make sure to pair your carbs with protein it seems to help keep your blood sugar stable.  I cut out all processed foods and that also seemed to help.  My carbs usually come from veggies and whole grain thin slice organic bread.  My numbers were good with after meals but I struggled with the fasting numbers.  My doctor told me it was nothing I was doing but the placenta telling the liver to make more insulin.  I had to start medicine and my numbers are all within range.  I also noticed if I walk for 15 to 30 minutes after a meal my blood sugar levels were better."
            },
            {
              "RESPONSE_DATE": "2017-03-12T12:47:51-05:00"
            },
            {
              "RESPONSE_ID": "14142038"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Hi, how are you going now. \nGD is a moving ship... because as the pregnancy progresses blood sugars become even harder to manage. \n\nLowering numbers is best done eating low carb (this may be opposite what the dietician has told you).  Many still recommend high carb for diabetes. \n\nWhen i was pregnant I ate very low carb.  And I also took insulin.  My diet consisted of meat, eggs, nuts, cheese, cream, plenty of non-starchy vegetables.  I avoid grains most of the time and also sugars, sweets, and most fruits. \n\nIf you are not able to manage your blood sugar with diet and exercise, then you will need medications.  The most commonly used medication in pregnancy is injected insulin.  Don't be scared of using insulin, it is really a very helpful medication when needed.  Using insulin and lower carb eating can be what you need to have a healthy pregnancy with a beautiful healthy baby as the outcome. \n\nBest wishes."
            },
            {
              "RESPONSE_DATE": "2017-03-16T01:53:07-05:00"
            },
            {
              "RESPONSE_ID": "14144633"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Natamo715"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20044487"
            },
            {
              "RESPONSE_BODY": "Thank you for all your input! I have found that by cutting out all bread and keeping it as low carb as possible has controlled my numbers. I am still lower in carbs than my dietician wants, but it is working for me and I get plenty of nutrients, so I am slightly shucking her recommendation. She wants me to get between 175-200g of carbs a day, but I find keeping it between 150-170 works best for me. I'm going to keep this up to see if I can make it to the end without meds/insulin."
            },
            {
              "RESPONSE_DATE": "2017-03-16T18:03:01-05:00"
            },
            {
              "RESPONSE_ID": "14145247"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "Hi, many dieticians still follow the old approach which is very high carb.  There is really no need to eat high carb.  Your baby doesn't get carbs from your blood stream, it gets glucose.  Glucose doesn't need to come from carbs, it can also come from protein. \n\nWhen we talk about nutrition, there are certain things that need to come from our diet.  These are called essential nutrients.  There are no essential carbs, but there are essential fatty acids (from fats) and essential amino acids (from protein foods).  \n\nWhat your baby needs is stable blood sugars. \n\nSounds like you are doing great,  Do what you need to keep your blood sugars where they should be. \n\nPlease do make sure you get tested again for blood sugar levels after delivery and even keep monitoring yourself from time to time.  For some women diabetes during pregnancy is a precursor to type 1 or type 2 diabetes after (either immediately, or in the years following)."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14145391"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}