{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/For-anyone-with-pregnancy-diabetes-/show/2988416"
    },
    {
      "USER_NAME": "babyboo2013"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19976484"
    },
    {
      "POST_TITLE": "For anyone with pregnancy diabetes"
    },
    {
      "POST_BODY": "I know everywhere is different so how long you sit for the glucose is different. I'm in Canada and it's 1 hour and if you fail it's 2 hours. I just failed the first hour so I had to do the 2 hour. I got the call saying 2 out of 3 tests were normal. The middle one wasn't. How many of you failed the second test but your doctor still didn't have much concern since only 1 out of 3 came back high. He told me to see a dietitian next week but me to keep eating how I'm eating. He never said anything about medication at all though. Did anyone of you have to go in medication at all or just check your blood"
    },
    {
      "POST_DATE": "2017-07-24T12:53:09-05:00"
    },
    {
      "POST_ID": "2988416"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "emy_aiden"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20269131"
            },
            {
              "RESPONSE_BODY": "Im in connecticut over here is 1 hour dont pass 3 hour i had to do mines 3 time i fail 1 pass 2 but my docotor not concern neither just drink alot water cut the soda juice and sugary stuff out i did 1 month and they did another to see how i was doing and i pass just do what your doctor say and be careful of what you eat"
            },
            {
              "RESPONSE_DATE": "2017-07-24T13:09:49-05:00"
            },
            {
              "RESPONSE_ID": "14223487"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "purple1234567"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5536886"
            },
            {
              "RESPONSE_BODY": "It depends on how much you failed by, how they will handle it- sounds like you could be considered boarder line, in which case, they will have some recommendations for you on what to eat and what not to eat, but you won't be diagnosed with gestational diabetes officially."
            },
            {
              "RESPONSE_DATE": "2017-07-26T16:10:33-05:00"
            },
            {
              "RESPONSE_ID": "14224970"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "babyboo2013"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/19976484"
                    },
                    {
                      "COMMENT_BODY": "My doctor told me the second test was 11.4 or 11.8 and 11.something and under would have been fine. The other 2 were normal so I think he really like you said what to eat and what not to. I cut down on a lot of junk and basically having water only. I know fruit has natural sugar but I like fruit so that I would have to cut back on especially bananas since they are high in sugar and eat more veggies"
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14224971"
                    }
                  ]
                },
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "purple1234567"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5536886"
                    },
                    {
                      "COMMENT_BODY": "How are you doing now?  Were you able to cut back on the fruit ok?  I remember that being the hardest part for me!"
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14241771"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}