{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes-im-22-weeks-its-so-tough-/show/2506185"
    },
    {
      "USER_NAME": "pritigrl15"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11272604"
    },
    {
      "POST_TITLE": "gestational diabetes im 22 weeks. its so tough ):"
    },
    {
      "POST_BODY": "Its like the most I try to keep controlled the more out of whack they get!\nI'm on 3 units novolog .before every meal and 10 units levemire nightly.\nI don't eat bad I stick with soups egg Peta breads peanut butter sandwixh witb one bread and it can still be high !!!!!!!!!!! \nAny tips how mommas did it? \nIm losing my mind. \nToday I ate a small burger and like 5 fries with a little sprite after the 2 hrs I was at 150! I was supposed to check it after the hr but barely picked up machine at pharmacy I can just imagine how high it was after the hr.\n\nSpecialists wants me after the hr of every meal under 120 mornings under 90"
    },
    {
      "POST_DATE": "2015-03-17T16:37:33-05:00"
    },
    {
      "POST_ID": "2506185"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/user_profiles/show/231441"
            },
            {
              "RESPONSE_BODY": "Hi,\n\nHere's the thing with diabetic pregnancy.  The  insulin resistance keeps increasing (so blood sugar keeps getting harder to control) as the pregnancy progresses.\n\nYou will need to increase your meal time insulin, if you are going high.  Sprite is pure sugar; you need to avoid all soft drinks and sugars.\n\nControlling how much carb you eat / Lower carb is really important during pregnancy to be able to control how high your sugars go.  You may need to increase the veges and meats and reduce the breads further.  I found I had to eat very low carb (in addition to using lots of insulin) in order to control my blood sugars when I was pregnant.  Your baby doesn't know how much carb you eat, but what affects it is your blood sugar levels.    \n\nDo you know how to count carbs and match the insulin to the carbs?\n\nFor example, if you are going to eat 30 g of carb at 1 meal, then you need to know how many units of insulin will cover that.  It may be 1 unit of insulin covers 10 g of carbs?  or maybe 1 unit covers 5 g of carb.  During pregnancy this will continue to change and you will continue to need more insulin.\n\nHas your dr instructed you how to do corrections with insulin. For example, when I am high, I know that 1 unit of insulin will bring my blood sugar down by 10 points.  Then if I am 150 at 3 hours after eating, I will correct.\n\nYour basal insulin (the levemir) will also need to be increased as the pregnancy progresses.\n\nPlease ask your doctor about all of the points raised here.\n\nAlso, you may find that exercise (walking or other exercise for 30 minutes) after eating, helps to bring down your sugars as well.\n\nHope it helps.  The efforts will be worth it.\n\nIt is possible to control blood sugar to the degree they want, but only if you understand how to use insulin to it's full advantage.\n\nYou can get the following books which may help, as they describe how to use and adjust insulin doses:-\n\nThink Like a Pancreas\nUsing INsulin - John Walsh\nDiabetes Solutions - Dr. Bernstein\n\nHopefully your dr. can refer you to a diabetes educator who can teach you further how to adjust and use insulin."
            },
            {
              "RESPONSE_DATE": "2015-03-17T20:43:47-05:00"
            },
            {
              "RESPONSE_ID": "12193455"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pritigrl15"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/user_profiles/show/11272604"
            },
            {
              "RESPONSE_BODY": "I will ask thank u so much \nI can't eat anything without it spiking up like literally. \nfor it to be controlled I have to eat a peanut butter sandwich with one bread or a sandwich with just ham and one bread for it to be good. And then I'm starving an hr later. \nI'm just nervous after my meal for lunch the hr I'm 150-140"
            },
            {
              "RESPONSE_DATE": "2015-03-18T17:50:45-05:00"
            },
            {
              "RESPONSE_ID": "12198809"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/user_profiles/show/231441"
            },
            {
              "RESPONSE_BODY": "Hon,\n\nYou need to eat heaps more fat and protein, and really restrict the carbs.\n\nFat has zero impact on blood sugar.  Protein has minimal effect and much slower than that of carbs.\n\nFor example.  1 bread (ok), but also 3 or 4 slices of ham, and a couple of slices of cheese, and add some green salad.    Or skip the bread altogether and make a huge salad with meat, greens, cheese, and dressing.  \n\nAvocado is a great source of fat and highly nutritious.  It is also filling.  \n\nUse your peanut butter (no sugar added, I hope), as a dip for vegetable sticks.\n\nEggs.  Very good!  Omlete or quiche is great with added cheese and veges.  You can even beat the egg with some cream (gives a great texture).  It can also be an option for lunch.  Quiche can keep for several days in the fridge and save you having to cook every day.\n\nHope this helps.  \n\nRoast chicken (eat the skin as well), and green veges."
            },
            {
              "RESPONSE_DATE": "2015-03-18T21:18:33-05:00"
            },
            {
              "RESPONSE_ID": "12199780"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "pritigrl15"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/user_profiles/show/11272604"
            },
            {
              "RESPONSE_BODY": "I must try \nThank you \nI can't eat avocado my sugar spikes with it. I ate it with a Peta bread and salad and little mayo and it went up. \nWhen I ate it again minus avocado it was fine. \nI'm trying to see what works for me and I'm shocked surprised stressed on how one week I can be fine and just next so off. \nI can't eat peanut butter now my sugar spikes to 130 after the hr. \n\nI hope I figure this out soon and fast I just spiked to 170 I know that's way bad for the hr result waiting to check in another hr (for the 2hr result)"
            },
            {
              "RESPONSE_DATE": "2015-03-19T19:05:49-05:00"
            },
            {
              "RESPONSE_ID": "12205097"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/user_profiles/show/231441"
            },
            {
              "RESPONSE_BODY": "You need to increase your meal time insulin dose already.  \n\n3 units may no longer be enough.  You may need to increase to 5 units or more.  Please contact your dr about this asap.\n\nMy doctor let me adjust my own insulin.  He said when consistently high for more than 2 meals increase by 1 - 2 units of meal time insulin and observe.  \n\nSame for the fasting insulin. If I was higher than the target for 2 days running he had me increase the long acting insulin by 1 - 2 units.  If still high after 2 more days increase by another 1 - 2 units. \n\nThis will be a time of rapid change and you will need to keep adjusting your insulin levels to match.  \n\nI still recommend advocado.  it is high in healthy fats and very nutritious.  You just need to take insulin to cover what you are eating."
            },
            {
              "RESPONSE_DATE": "2015-03-19T21:04:25-05:00"
            },
            {
              "RESPONSE_ID": "12205676"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}