{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/Anyone-with-Gestational-Diabetes/show/1936173"
    },
    {
      "USER_NAME": "Hol739"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/624083"
    },
    {
      "POST_TITLE": "Anyone with Gestational Diabetes?"
    },
    {
      "POST_BODY": "Hi... I'm currently 13 weeks 4 days. I was tested when I was just 8 weeks for my 1 hour and I failed it by one point, so I went back and tested the 3 hour and failed 2 of the tested so they told me I have Gestational Diabetes. I currently also have Thyroid Hypo with Hashi.\rI've changed my diet and been doing good with my BS during the days, but I can't seem to get my fasting sugar level in the morning to be under 90 where they want me to be. So they jumped to put me on Glyburide 2.5 mg and I'm scared to death to take it, I'm scared it's not safe for the baby, because what I'm reading online is telling me it hasn't been tested to determine if it's safe. And I'm also worried that it could seriously drop my blood sugars. Would this just make my BS lower in the mornings, and then the rest of the day I will continue to be normal levels with what I've been doing? I've been a nervous wreck with this pregnancy, it's my second and so worried. Has or is anyone else taking this medicine? And if anyone could give me some good pointers, I would so appreciate it. Never had this with my first pregnancy. THANKS A MILLION"
    },
    {
      "POST_DATE": "2013-04-23T14:38:31-05:00"
    },
    {
      "POST_ID": "1936173"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "Kate037"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5160116"
            },
            {
              "RESPONSE_BODY": "I have no experience with this.medicine, but I will tell you that  most doctors are very good at what they do. If there is a medication that has some risks, like you  believe this one does, they weigh the risks to the hereditaments decide if it's worth it. In this case your doctor probably decided that the medication would help more then harm. I wish I could help you more but I figured I would at least let you know someone read your question."
            },
            {
              "RESPONSE_DATE": "2013-04-23T15:09:18-05:00"
            },
            {
              "RESPONSE_ID": "9050490"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Kate037"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5160116"
            },
            {
              "RESPONSE_BODY": "Wow auto correct fail. They weigh the risks to the benefits."
            },
            {
              "RESPONSE_DATE": "2013-04-23T15:09:53-05:00"
            },
            {
              "RESPONSE_ID": "9050491"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}