{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/i-am-pregnant-with-gestational-diabetes-should-i-be-taking-insulin/show/3015961"
    },
    {
      "USER_NAME": "funnyvalentine81"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20813317"
    },
    {
      "POST_TITLE": "i am pregnant with gestational diabetes. should i be taking insulin?"
    },
    {
      "POST_BODY": "i have been measuring my blood sugar levels recently and it seems that mainly my problem is my fasting count -usually between 96 and 112. due to my pregnancy i am a bit more antsy about it and have begun measuring my blood sugar more often and at times at which i havent been specifically told to do so. for example now, 3/4 hours after last eating it is 133. am i right to worry? should i be taking insulin?\nthanks in advance."
    },
    {
      "POST_DATE": "2018-02-24T22:29:41-06:00"
    },
    {
      "POST_ID": "3015961"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "purple1234567"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/5536886"
            },
            {
              "RESPONSE_BODY": "Have you been able to set up a consultation with a dietician?  Your doctor should be monitoring these levels and should be directing you to insulin if needed.  Insulin is usually the best option for women who have gestation diabetes and need a little help, although they usually try to get you to track what you are eating and your levels for a short time first- to see if you can control it with your diet. \n\nWhat types of foods are you eating?  Are you staying away from carbs?  At night, before bed, do you have any snacks?  If not- work on getting high protein foods into your diet, and cut back on the carbs.  Your fasting sugars can usually be brought down by having a good protein/low carb snack a little bit before bed."
            },
            {
              "RESPONSE_DATE": "2018-03-02T08:56:58-06:00"
            },
            {
              "RESPONSE_ID": "14311559"
            },
            {
              "COMMENTS": [
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "ShreyaPandey"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/20819343"
                    },
                    {
                      "COMMENT_BODY": "Unless you were taking insulin previous to pregnancy, then all treatment will cease once your baby is born."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14320301"
                    }
                  ]
                },
                {
                  "COMMENT": [
                    {
                      "USER_NAME": "Super_sally888"
                    },
                    {
                      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
                    },
                    {
                      "COMMENT_BODY": "After delivery you still need to monitor blood sugars to see that they have gone back to normal.  For some women, gestational diabetes is a trigger to either type 2 or type 1 diabetes, and the diabetes will only improve, but no go away after the  baby is delivered."
                    },
                    {
                      "COPMMENT_DATE": ""
                    },
                    {
                      "COMMENT_ID": "14331419"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Super_sally888"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/231441"
            },
            {
              "RESPONSE_BODY": "Reducing carbs may help - replace with protein and healthy fats. \n\nYes, if yourvsugars continue to be above target, insulin will be your best choice for normalising blood sugars."
            },
            {
              "RESPONSE_DATE": "2018-03-09T20:53:13-06:00"
            },
            {
              "RESPONSE_ID": "14313938"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}