{
  "POST": [
    {
      "POST_LINK": "https://medhelp.org/posts/Diabetes---Gestational/gestational-diabetes/show/2596754"
    },
    {
      "USER_NAME": "linalop17"
    },
    {
      "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13829181"
    },
    {
      "POST_TITLE": "gestational diabetes"
    },
    {
      "POST_BODY": "I've been diagnosed with gestational diabetes,  any one know of any good shakes or natural remedies that can help?"
    },
    {
      "POST_DATE": "2015-05-14T20:07:35-05:00"
    },
    {
      "POST_ID": "2596754"
    },
    {
      "RESPONSES": [
        {
          "RESPONSE": [
            {
              "USER_NAME": "GeekMom1213"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/7283364"
            },
            {
              "RESPONSE_BODY": "You should be meeting with a dietician and a diabetes specialist (mine is a nurse practitioner but that's obviously not necessarily the only type of professional who can help) who will be able to start you with dietary restrictions and a testing regimen to begin to monitor and control your diabetes. \nMany women are able to control their sugars with diet alone, which is the closest thing you'll find to a \"natural remedy\". If the hormonal changes in your body have affected your natural insulin production to the point that diet restrictions aren't enough, you will need to start a medication regimen - an oral medication will be the first step, with insulin injections used only if all previous interventions have failed."
            },
            {
              "RESPONSE_DATE": "2015-05-14T20:20:41-05:00"
            },
            {
              "RESPONSE_ID": "12625110"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "linalop17"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13829181"
            },
            {
              "RESPONSE_BODY": "Thank you. .n. Yes I've met with a nutritionist but those meal don't seem to help. . What about stress with that affect levals?"
            },
            {
              "RESPONSE_DATE": "2015-05-14T20:25:12-05:00"
            },
            {
              "RESPONSE_ID": "12625131"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "Chrissylpr"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/13183919"
            },
            {
              "RESPONSE_BODY": "Stress does effect your blood sugar, I'm just a plain ol' diabetic, very controlled before pregnancy. The hormones and stress has made my bs very hard to control and the future along you are, the more sugar ur placenta and hormones will produce. I have completely eliminated bread,starch of any kind and sugar. It's hard if you have cravings but worth the struggle in the end. Good luck!"
            },
            {
              "RESPONSE_DATE": "2015-05-14T20:29:14-05:00"
            },
            {
              "RESPONSE_ID": "12625160"
            },
            {
              "COMMENTS": []
            }
          ]
        },
        {
          "RESPONSE": [
            {
              "USER_NAME": "kd97229"
            },
            {
              "USER_PROFILE_LINK": "https://medhelp.org/personal_pages/user/11740576"
            },
            {
              "RESPONSE_BODY": "I agree with pps. If you are sticking with your diet and still having high sugars, you need to contact your doctor for the next step, which could be medication. \n\nI understand your hesitation. I also think many medical problems these days can be solved by lifestyle and diet changes. I had gd with my last pregnancy that was well-managed with diet, so this pregnancy I was disappointed and thought I was doing something wrong even though I was eating almost no carbs and having high sugars. Once I went to insulin (after a brief time on oral meds), I feel great, can eat more normally, and baby is still growing at a good rate. I was able to relax much more and not stress about my baby's health.\n\nTake advantage of your nutritionist's and doctor's advice and keep in contact with them often until you feel at ease with your routine. GD is not a big problem if you keep it under control.\n\nGood luck!!"
            },
            {
              "RESPONSE_DATE": "2015-05-14T21:12:26-05:00"
            },
            {
              "RESPONSE_ID": "12625455"
            },
            {
              "COMMENTS": []
            }
          ]
        }
      ]
    }
  ]
}